GopalSaraf/Practicals/PSDL/include/proc/pic18lf65k40.inc
// Register: PIR5
#define PIR5 PIR5
PIR5                                     equ 0E38h
// bitfield definitions
PIR5_TMR1IF_POSN                         equ 0000h
PIR5_TMR1IF_POSITION                     equ 0000h
PIR5_TMR1IF_SIZE                         equ 0001h
PIR5_TMR1IF_LENGTH                       equ 0001h
PIR5_TMR1IF_MASK                         equ 0001h
PIR5_TMR2IF_POSN                         equ 0001h
PIR5_TMR2IF_POSITION                     equ 0001h
PIR5_TMR2IF_SIZE                         equ 0001h
PIR5_TMR2IF_LENGTH                       equ 0001h
PIR5_TMR2IF_MASK                         equ 0002h
PIR5_TMR3IF_POSN                         equ 0002h
PIR5_TMR3IF_POSITION                     equ 0002h
PIR5_TMR3IF_SIZE                         equ 0001h
PIR5_TMR3IF_LENGTH                       equ 0001h
PIR5_TMR3IF_MASK                         equ 0004h
PIR5_TMR4IF_POSN                         equ 0003h
PIR5_TMR4IF_POSITION                     equ 0003h
PIR5_TMR4IF_SIZE                         equ 0001h
PIR5_TMR4IF_LENGTH                       equ 0001h
PIR5_TMR4IF_MASK                         equ 0008h
PIR5_TMR5IF_POSN                         equ 0004h
PIR5_TMR5IF_POSITION                     equ 0004h
PIR5_TMR5IF_SIZE                         equ 0001h
PIR5_TMR5IF_LENGTH                       equ 0001h
PIR5_TMR5IF_MASK                         equ 0010h
PIR5_TMR6IF_POSN                         equ 0005h
PIR5_TMR6IF_POSITION                     equ 0005h
PIR5_TMR6IF_SIZE                         equ 0001h
PIR5_TMR6IF_LENGTH                       equ 0001h
PIR5_TMR6IF_MASK                         equ 0020h
PIR5_TMR7IF_POSN                         equ 0006h
PIR5_TMR7IF_POSITION                     equ 0006h
PIR5_TMR7IF_SIZE                         equ 0001h
PIR5_TMR7IF_LENGTH                       equ 0001h
PIR5_TMR7IF_MASK                         equ 0040h
PIR5_TMR8IF_POSN                         equ 0007h
PIR5_TMR8IF_POSITION                     equ 0007h
PIR5_TMR8IF_SIZE                         equ 0001h
PIR5_TMR8IF_LENGTH                       equ 0001h
PIR5_TMR8IF_MASK                         equ 0080h

// Register: PIR6
#define PIR6 PIR6
PIR6                                     equ 0E39h
// bitfield definitions
PIR6_TMR1GIF_POSN                        equ 0000h
PIR6_TMR1GIF_POSITION                    equ 0000h
PIR6_TMR1GIF_SIZE                        equ 0001h
PIR6_TMR1GIF_LENGTH                      equ 0001h
PIR6_TMR1GIF_MASK                        equ 0001h
PIR6_TMR3GIF_POSN                        equ 0001h
PIR6_TMR3GIF_POSITION                    equ 0001h
PIR6_TMR3GIF_SIZE                        equ 0001h
PIR6_TMR3GIF_LENGTH                      equ 0001h
PIR6_TMR3GIF_MASK                        equ 0002h
PIR6_TMR5GIF_POSN                        equ 0002h
PIR6_TMR5GIF_POSITION                    equ 0002h
PIR6_TMR5GIF_SIZE                        equ 0001h
PIR6_TMR5GIF_LENGTH                      equ 0001h
PIR6_TMR5GIF_MASK                        equ 0004h
PIR6_TMR7GIF_POSN                        equ 0003h
PIR6_TMR7GIF_POSITION                    equ 0003h
PIR6_TMR7GIF_SIZE                        equ 0001h
PIR6_TMR7GIF_LENGTH                      equ 0001h
PIR6_TMR7GIF_MASK                        equ 0008h

// Register: PIR7
#define PIR7 PIR7
PIR7                                     equ 0E3Ah
// bitfield definitions
PIR7_CCP1IF_POSN                         equ 0000h
PIR7_CCP1IF_POSITION                     equ 0000h
PIR7_CCP1IF_SIZE                         equ 0001h
PIR7_CCP1IF_LENGTH                       equ 0001h
PIR7_CCP1IF_MASK                         equ 0001h
PIR7_CCP2IF_POSN                         equ 0001h
PIR7_CCP2IF_POSITION                     equ 0001h
PIR7_CCP2IF_SIZE                         equ 0001h
PIR7_CCP2IF_LENGTH                       equ 0001h
PIR7_CCP2IF_MASK                         equ 0002h
PIR7_CCP3IF_POSN                         equ 0002h
PIR7_CCP3IF_POSITION                     equ 0002h
PIR7_CCP3IF_SIZE                         equ 0001h
PIR7_CCP3IF_LENGTH                       equ 0001h
PIR7_CCP3IF_MASK                         equ 0004h
PIR7_CCP4IF_POSN                         equ 0003h
PIR7_CCP4IF_POSITION                     equ 0003h
PIR7_CCP4IF_SIZE                         equ 0001h
PIR7_CCP4IF_LENGTH                       equ 0001h
PIR7_CCP4IF_MASK                         equ 0008h
PIR7_CCP5IF_POSN                         equ 0004h
PIR7_CCP5IF_POSITION                     equ 0004h
PIR7_CCP5IF_SIZE                         equ 0001h
PIR7_CCP5IF_LENGTH                       equ 0001h
PIR7_CCP5IF_MASK                         equ 0010h

// Register: PIR8
#define PIR8 PIR8
PIR8                                     equ 0E3Bh
// bitfield definitions
PIR8_CWGIF_POSN                          equ 0000h
PIR8_CWGIF_POSITION                      equ 0000h
PIR8_CWGIF_SIZE                          equ 0001h
PIR8_CWGIF_LENGTH                        equ 0001h
PIR8_CWGIF_MASK                          equ 0001h
PIR8_NVMIF_POSN                          equ 0005h
PIR8_NVMIF_POSITION                      equ 0005h
PIR8_NVMIF_SIZE                          equ 0001h
PIR8_NVMIF_LENGTH                        equ 0001h
PIR8_NVMIF_MASK                          equ 0020h
PIR8_CRCIF_POSN                          equ 0006h
PIR8_CRCIF_POSITION                      equ 0006h
PIR8_CRCIF_SIZE                          equ 0001h
PIR8_CRCIF_LENGTH                        equ 0001h
PIR8_CRCIF_MASK                          equ 0040h
PIR8_SCANIF_POSN                         equ 0007h
PIR8_SCANIF_POSITION                     equ 0007h
PIR8_SCANIF_SIZE                         equ 0001h
PIR8_SCANIF_LENGTH                       equ 0001h
PIR8_SCANIF_MASK                         equ 0080h
PIR8_CWG1IF_POSN                         equ 0000h
PIR8_CWG1IF_POSITION                     equ 0000h
PIR8_CWG1IF_SIZE                         equ 0001h
PIR8_CWG1IF_LENGTH                       equ 0001h
PIR8_CWG1IF_MASK                         equ 0001h

// Register: PIR9
#define PIR9 PIR9
PIR9                                     equ 0E3Ch
// bitfield definitions
PIR9_SMT1IF_POSN                         equ 0000h
PIR9_SMT1IF_POSITION                     equ 0000h
PIR9_SMT1IF_SIZE                         equ 0001h
PIR9_SMT1IF_LENGTH                       equ 0001h
PIR9_SMT1IF_MASK                         equ 0001h
PIR9_SMT1PRAIF_POSN                      equ 0001h
PIR9_SMT1PRAIF_POSITION                  equ 0001h
PIR9_SMT1PRAIF_SIZE                      equ 0001h
PIR9_SMT1PRAIF_LENGTH                    equ 0001h
PIR9_SMT1PRAIF_MASK                      equ 0002h
PIR9_SMT1PWAIF_POSN                      equ 0002h
PIR9_SMT1PWAIF_POSITION                  equ 0002h
PIR9_SMT1PWAIF_SIZE                      equ 0001h
PIR9_SMT1PWAIF_LENGTH                    equ 0001h
PIR9_SMT1PWAIF_MASK                      equ 0004h
PIR9_SMT2IF_POSN                         equ 0003h
PIR9_SMT2IF_POSITION                     equ 0003h
PIR9_SMT2IF_SIZE                         equ 0001h
PIR9_SMT2IF_LENGTH                       equ 0001h
PIR9_SMT2IF_MASK                         equ 0008h
PIR9_SMT2PRAIF_POSN                      equ 0004h
PIR9_SMT2PRAIF_POSITION                  equ 0004h
PIR9_SMT2PRAIF_SIZE                      equ 0001h
PIR9_SMT2PRAIF_LENGTH                    equ 0001h
PIR9_SMT2PRAIF_MASK                      equ 0010h
PIR9_SMT2PWAIF_POSN                      equ 0005h
PIR9_SMT2PWAIF_POSITION                  equ 0005h
PIR9_SMT2PWAIF_SIZE                      equ 0001h
PIR9_SMT2PWAIF_LENGTH                    equ 0001h
PIR9_SMT2PWAIF_MASK                      equ 0020h

// Register: WDTCON0
#define WDTCON0 WDTCON0
WDTCON0                                  equ 0E3Dh
// bitfield definitions
WDTCON0_SEN_POSN                         equ 0000h
WDTCON0_SEN_POSITION                     equ 0000h
WDTCON0_SEN_SIZE                         equ 0001h
WDTCON0_SEN_LENGTH                       equ 0001h
WDTCON0_SEN_MASK                         equ 0001h
WDTCON0_WDTPS_POSN                       equ 0001h
WDTCON0_WDTPS_POSITION                   equ 0001h
WDTCON0_WDTPS_SIZE                       equ 0005h
WDTCON0_WDTPS_LENGTH                     equ 0005h
WDTCON0_WDTPS_MASK                       equ 003Eh
WDTCON0_SWDTEN_POSN                      equ 0000h
WDTCON0_SWDTEN_POSITION                  equ 0000h
WDTCON0_SWDTEN_SIZE                      equ 0001h
WDTCON0_SWDTEN_LENGTH                    equ 0001h
WDTCON0_SWDTEN_MASK                      equ 0001h
WDTCON0_WDTSEN_POSN                      equ 0000h
WDTCON0_WDTSEN_POSITION                  equ 0000h
WDTCON0_WDTSEN_SIZE                      equ 0001h
WDTCON0_WDTSEN_LENGTH                    equ 0001h
WDTCON0_WDTSEN_MASK                      equ 0001h
WDTCON0_WDTPS0_POSN                      equ 0001h
WDTCON0_WDTPS0_POSITION                  equ 0001h
WDTCON0_WDTPS0_SIZE                      equ 0001h
WDTCON0_WDTPS0_LENGTH                    equ 0001h
WDTCON0_WDTPS0_MASK                      equ 0002h
WDTCON0_WDTPS1_POSN                      equ 0002h
WDTCON0_WDTPS1_POSITION                  equ 0002h
WDTCON0_WDTPS1_SIZE                      equ 0001h
WDTCON0_WDTPS1_LENGTH                    equ 0001h
WDTCON0_WDTPS1_MASK                      equ 0004h
WDTCON0_WDTPS2_POSN                      equ 0003h
WDTCON0_WDTPS2_POSITION                  equ 0003h
WDTCON0_WDTPS2_SIZE                      equ 0001h
WDTCON0_WDTPS2_LENGTH                    equ 0001h
WDTCON0_WDTPS2_MASK                      equ 0008h
WDTCON0_WDTPS3_POSN                      equ 0004h
WDTCON0_WDTPS3_POSITION                  equ 0004h
WDTCON0_WDTPS3_SIZE                      equ 0001h
WDTCON0_WDTPS3_LENGTH                    equ 0001h
WDTCON0_WDTPS3_MASK                      equ 0010h
WDTCON0_WDTPS4_POSN                      equ 0005h
WDTCON0_WDTPS4_POSITION                  equ 0005h
WDTCON0_WDTPS4_SIZE                      equ 0001h
WDTCON0_WDTPS4_LENGTH                    equ 0001h
WDTCON0_WDTPS4_MASK                      equ 0020h

// Register: WDTCON1
#define WDTCON1 WDTCON1
WDTCON1                                  equ 0E3Eh
// bitfield definitions
WDTCON1_WINDOW_POSN                      equ 0000h
WDTCON1_WINDOW_POSITION                  equ 0000h
WDTCON1_WINDOW_SIZE                      equ 0003h
WDTCON1_WINDOW_LENGTH                    equ 0003h
WDTCON1_WINDOW_MASK                      equ 0007h
WDTCON1_WDTCS_POSN                       equ 0004h
WDTCON1_WDTCS_POSITION                   equ 0004h
WDTCON1_WDTCS_SIZE                       equ 0003h
WDTCON1_WDTCS_LENGTH                     equ 0003h
WDTCON1_WDTCS_MASK                       equ 0070h
WDTCON1_WINDOW0_POSN                     equ 0000h
WDTCON1_WINDOW0_POSITION                 equ 0000h
WDTCON1_WINDOW0_SIZE                     equ 0001h
WDTCON1_WINDOW0_LENGTH                   equ 0001h
WDTCON1_WINDOW0_MASK                     equ 0001h
WDTCON1_WINDOW1_POSN                     equ 0001h
WDTCON1_WINDOW1_POSITION                 equ 0001h
WDTCON1_WINDOW1_SIZE                     equ 0001h
WDTCON1_WINDOW1_LENGTH                   equ 0001h
WDTCON1_WINDOW1_MASK                     equ 0002h
WDTCON1_WINDOW2_POSN                     equ 0002h
WDTCON1_WINDOW2_POSITION                 equ 0002h
WDTCON1_WINDOW2_SIZE                     equ 0001h
WDTCON1_WINDOW2_LENGTH                   equ 0001h
WDTCON1_WINDOW2_MASK                     equ 0004h
WDTCON1_WDTWINDOW_POSN                   equ 0000h
WDTCON1_WDTWINDOW_POSITION               equ 0000h
WDTCON1_WDTWINDOW_SIZE                   equ 0003h
WDTCON1_WDTWINDOW_LENGTH                 equ 0003h
WDTCON1_WDTWINDOW_MASK                   equ 0007h
WDTCON1_WDTWINDOW0_POSN                  equ 0000h
WDTCON1_WDTWINDOW0_POSITION              equ 0000h
WDTCON1_WDTWINDOW0_SIZE                  equ 0001h
WDTCON1_WDTWINDOW0_LENGTH                equ 0001h
WDTCON1_WDTWINDOW0_MASK                  equ 0001h
WDTCON1_WDTWINDOW1_POSN                  equ 0001h
WDTCON1_WDTWINDOW1_POSITION              equ 0001h
WDTCON1_WDTWINDOW1_SIZE                  equ 0001h
WDTCON1_WDTWINDOW1_LENGTH                equ 0001h
WDTCON1_WDTWINDOW1_MASK                  equ 0002h
WDTCON1_WDTWINDOW2_POSN                  equ 0002h
WDTCON1_WDTWINDOW2_POSITION              equ 0002h
WDTCON1_WDTWINDOW2_SIZE                  equ 0001h
WDTCON1_WDTWINDOW2_LENGTH                equ 0001h
WDTCON1_WDTWINDOW2_MASK                  equ 0004h
WDTCON1_WDTCS0_POSN                      equ 0004h
WDTCON1_WDTCS0_POSITION                  equ 0004h
WDTCON1_WDTCS0_SIZE                      equ 0001h
WDTCON1_WDTCS0_LENGTH                    equ 0001h
WDTCON1_WDTCS0_MASK                      equ 0010h
WDTCON1_WDTCS1_POSN                      equ 0005h
WDTCON1_WDTCS1_POSITION                  equ 0005h
WDTCON1_WDTCS1_SIZE                      equ 0001h
WDTCON1_WDTCS1_LENGTH                    equ 0001h
WDTCON1_WDTCS1_MASK                      equ 0020h
WDTCON1_WDTCS2_POSN                      equ 0006h
WDTCON1_WDTCS2_POSITION                  equ 0006h
WDTCON1_WDTCS2_SIZE                      equ 0001h
WDTCON1_WDTCS2_LENGTH                    equ 0001h
WDTCON1_WDTCS2_MASK                      equ 0040h

// Register: WDTPSL
#define WDTPSL WDTPSL
WDTPSL                                   equ 0E3Fh
// bitfield definitions
WDTPSL_PSCNT_POSN                        equ 0000h
WDTPSL_PSCNT_POSITION                    equ 0000h
WDTPSL_PSCNT_SIZE                        equ 0008h
WDTPSL_PSCNT_LENGTH                      equ 0008h
WDTPSL_PSCNT_MASK                        equ 00FFh
WDTPSL_PSCNT0_POSN                       equ 0000h
WDTPSL_PSCNT0_POSITION                   equ 0000h
WDTPSL_PSCNT0_SIZE                       equ 0001h
WDTPSL_PSCNT0_LENGTH                     equ 0001h
WDTPSL_PSCNT0_MASK                       equ 0001h
WDTPSL_PSCNT1_POSN                       equ 0001h
WDTPSL_PSCNT1_POSITION                   equ 0001h
WDTPSL_PSCNT1_SIZE                       equ 0001h
WDTPSL_PSCNT1_LENGTH                     equ 0001h
WDTPSL_PSCNT1_MASK                       equ 0002h
WDTPSL_PSCNT2_POSN                       equ 0002h
WDTPSL_PSCNT2_POSITION                   equ 0002h
WDTPSL_PSCNT2_SIZE                       equ 0001h
WDTPSL_PSCNT2_LENGTH                     equ 0001h
WDTPSL_PSCNT2_MASK                       equ 0004h
WDTPSL_PSCNT3_POSN                       equ 0003h
WDTPSL_PSCNT3_POSITION                   equ 0003h
WDTPSL_PSCNT3_SIZE                       equ 0001h
WDTPSL_PSCNT3_LENGTH                     equ 0001h
WDTPSL_PSCNT3_MASK                       equ 0008h
WDTPSL_PSCNT4_POSN                       equ 0004h
WDTPSL_PSCNT4_POSITION                   equ 0004h
WDTPSL_PSCNT4_SIZE                       equ 0001h
WDTPSL_PSCNT4_LENGTH                     equ 0001h
WDTPSL_PSCNT4_MASK                       equ 0010h
WDTPSL_PSCNT5_POSN                       equ 0005h
WDTPSL_PSCNT5_POSITION                   equ 0005h
WDTPSL_PSCNT5_SIZE                       equ 0001h
WDTPSL_PSCNT5_LENGTH                     equ 0001h
WDTPSL_PSCNT5_MASK                       equ 0020h
WDTPSL_PSCNT6_POSN                       equ 0006h
WDTPSL_PSCNT6_POSITION                   equ 0006h
WDTPSL_PSCNT6_SIZE                       equ 0001h
WDTPSL_PSCNT6_LENGTH                     equ 0001h
WDTPSL_PSCNT6_MASK                       equ 0040h
WDTPSL_PSCNT7_POSN                       equ 0007h
WDTPSL_PSCNT7_POSITION                   equ 0007h
WDTPSL_PSCNT7_SIZE                       equ 0001h
WDTPSL_PSCNT7_LENGTH                     equ 0001h
WDTPSL_PSCNT7_MASK                       equ 0080h
WDTPSL_WDTPSCNT_POSN                     equ 0000h
WDTPSL_WDTPSCNT_POSITION                 equ 0000h
WDTPSL_WDTPSCNT_SIZE                     equ 0008h
WDTPSL_WDTPSCNT_LENGTH                   equ 0008h
WDTPSL_WDTPSCNT_MASK                     equ 00FFh
WDTPSL_WDTPSCNT0_POSN                    equ 0000h
WDTPSL_WDTPSCNT0_POSITION                equ 0000h
WDTPSL_WDTPSCNT0_SIZE                    equ 0001h
WDTPSL_WDTPSCNT0_LENGTH                  equ 0001h
WDTPSL_WDTPSCNT0_MASK                    equ 0001h
WDTPSL_WDTPSCNT1_POSN                    equ 0001h
WDTPSL_WDTPSCNT1_POSITION                equ 0001h
WDTPSL_WDTPSCNT1_SIZE                    equ 0001h
WDTPSL_WDTPSCNT1_LENGTH                  equ 0001h
WDTPSL_WDTPSCNT1_MASK                    equ 0002h
WDTPSL_WDTPSCNT2_POSN                    equ 0002h
WDTPSL_WDTPSCNT2_POSITION                equ 0002h
WDTPSL_WDTPSCNT2_SIZE                    equ 0001h
WDTPSL_WDTPSCNT2_LENGTH                  equ 0001h
WDTPSL_WDTPSCNT2_MASK                    equ 0004h
WDTPSL_WDTPSCNT3_POSN                    equ 0003h
WDTPSL_WDTPSCNT3_POSITION                equ 0003h
WDTPSL_WDTPSCNT3_SIZE                    equ 0001h
WDTPSL_WDTPSCNT3_LENGTH                  equ 0001h
WDTPSL_WDTPSCNT3_MASK                    equ 0008h
WDTPSL_WDTPSCNT4_POSN                    equ 0004h
WDTPSL_WDTPSCNT4_POSITION                equ 0004h
WDTPSL_WDTPSCNT4_SIZE                    equ 0001h
WDTPSL_WDTPSCNT4_LENGTH                  equ 0001h
WDTPSL_WDTPSCNT4_MASK                    equ 0010h
WDTPSL_WDTPSCNT5_POSN                    equ 0005h
WDTPSL_WDTPSCNT5_POSITION                equ 0005h
WDTPSL_WDTPSCNT5_SIZE                    equ 0001h
WDTPSL_WDTPSCNT5_LENGTH                  equ 0001h
WDTPSL_WDTPSCNT5_MASK                    equ 0020h
WDTPSL_WDTPSCNT6_POSN                    equ 0006h
WDTPSL_WDTPSCNT6_POSITION                equ 0006h
WDTPSL_WDTPSCNT6_SIZE                    equ 0001h
WDTPSL_WDTPSCNT6_LENGTH                  equ 0001h
WDTPSL_WDTPSCNT6_MASK                    equ 0040h
WDTPSL_WDTPSCNT7_POSN                    equ 0007h
WDTPSL_WDTPSCNT7_POSITION                equ 0007h
WDTPSL_WDTPSCNT7_SIZE                    equ 0001h
WDTPSL_WDTPSCNT7_LENGTH                  equ 0001h
WDTPSL_WDTPSCNT7_MASK                    equ 0080h

// Register: WDTPSH
#define WDTPSH WDTPSH
WDTPSH                                   equ 0E40h
// bitfield definitions
WDTPSH_PSCNT_POSN                        equ 0000h
WDTPSH_PSCNT_POSITION                    equ 0000h
WDTPSH_PSCNT_SIZE                        equ 0008h
WDTPSH_PSCNT_LENGTH                      equ 0008h
WDTPSH_PSCNT_MASK                        equ 00FFh
WDTPSH_PSCNT8_POSN                       equ 0000h
WDTPSH_PSCNT8_POSITION                   equ 0000h
WDTPSH_PSCNT8_SIZE                       equ 0001h
WDTPSH_PSCNT8_LENGTH                     equ 0001h
WDTPSH_PSCNT8_MASK                       equ 0001h
WDTPSH_PSCNT9_POSN                       equ 0001h
WDTPSH_PSCNT9_POSITION                   equ 0001h
WDTPSH_PSCNT9_SIZE                       equ 0001h
WDTPSH_PSCNT9_LENGTH                     equ 0001h
WDTPSH_PSCNT9_MASK                       equ 0002h
WDTPSH_PSCNT10_POSN                      equ 0002h
WDTPSH_PSCNT10_POSITION                  equ 0002h
WDTPSH_PSCNT10_SIZE                      equ 0001h
WDTPSH_PSCNT10_LENGTH                    equ 0001h
WDTPSH_PSCNT10_MASK                      equ 0004h
WDTPSH_PSCNT11_POSN                      equ 0003h
WDTPSH_PSCNT11_POSITION                  equ 0003h
WDTPSH_PSCNT11_SIZE                      equ 0001h
WDTPSH_PSCNT11_LENGTH                    equ 0001h
WDTPSH_PSCNT11_MASK                      equ 0008h
WDTPSH_PSCNT12_POSN                      equ 0004h
WDTPSH_PSCNT12_POSITION                  equ 0004h
WDTPSH_PSCNT12_SIZE                      equ 0001h
WDTPSH_PSCNT12_LENGTH                    equ 0001h
WDTPSH_PSCNT12_MASK                      equ 0010h
WDTPSH_PSCNT13_POSN                      equ 0005h
WDTPSH_PSCNT13_POSITION                  equ 0005h
WDTPSH_PSCNT13_SIZE                      equ 0001h
WDTPSH_PSCNT13_LENGTH                    equ 0001h
WDTPSH_PSCNT13_MASK                      equ 0020h
WDTPSH_PSCNT14_POSN                      equ 0006h
WDTPSH_PSCNT14_POSITION                  equ 0006h
WDTPSH_PSCNT14_SIZE                      equ 0001h
WDTPSH_PSCNT14_LENGTH                    equ 0001h
WDTPSH_PSCNT14_MASK                      equ 0040h
WDTPSH_PSCNT15_POSN                      equ 0007h
WDTPSH_PSCNT15_POSITION                  equ 0007h
WDTPSH_PSCNT15_SIZE                      equ 0001h
WDTPSH_PSCNT15_LENGTH                    equ 0001h
WDTPSH_PSCNT15_MASK                      equ 0080h
WDTPSH_WDTPSCNT_POSN                     equ 0000h
WDTPSH_WDTPSCNT_POSITION                 equ 0000h
WDTPSH_WDTPSCNT_SIZE                     equ 0008h
WDTPSH_WDTPSCNT_LENGTH                   equ 0008h
WDTPSH_WDTPSCNT_MASK                     equ 00FFh
WDTPSH_WDTPSCNT8_POSN                    equ 0000h
WDTPSH_WDTPSCNT8_POSITION                equ 0000h
WDTPSH_WDTPSCNT8_SIZE                    equ 0001h
WDTPSH_WDTPSCNT8_LENGTH                  equ 0001h
WDTPSH_WDTPSCNT8_MASK                    equ 0001h
WDTPSH_WDTPSCNT9_POSN                    equ 0001h
WDTPSH_WDTPSCNT9_POSITION                equ 0001h
WDTPSH_WDTPSCNT9_SIZE                    equ 0001h
WDTPSH_WDTPSCNT9_LENGTH                  equ 0001h
WDTPSH_WDTPSCNT9_MASK                    equ 0002h
WDTPSH_WDTPSCNT10_POSN                   equ 0002h
WDTPSH_WDTPSCNT10_POSITION               equ 0002h
WDTPSH_WDTPSCNT10_SIZE                   equ 0001h
WDTPSH_WDTPSCNT10_LENGTH                 equ 0001h
WDTPSH_WDTPSCNT10_MASK                   equ 0004h
WDTPSH_WDTPSCNT11_POSN                   equ 0003h
WDTPSH_WDTPSCNT11_POSITION               equ 0003h
WDTPSH_WDTPSCNT11_SIZE                   equ 0001h
WDTPSH_WDTPSCNT11_LENGTH                 equ 0001h
WDTPSH_WDTPSCNT11_MASK                   equ 0008h
WDTPSH_WDTPSCNT12_POSN                   equ 0004h
WDTPSH_WDTPSCNT12_POSITION               equ 0004h
WDTPSH_WDTPSCNT12_SIZE                   equ 0001h
WDTPSH_WDTPSCNT12_LENGTH                 equ 0001h
WDTPSH_WDTPSCNT12_MASK                   equ 0010h
WDTPSH_WDTPSCNT13_POSN                   equ 0005h
WDTPSH_WDTPSCNT13_POSITION               equ 0005h
WDTPSH_WDTPSCNT13_SIZE                   equ 0001h
WDTPSH_WDTPSCNT13_LENGTH                 equ 0001h
WDTPSH_WDTPSCNT13_MASK                   equ 0020h
WDTPSH_WDTPSCNT14_POSN                   equ 0006h
WDTPSH_WDTPSCNT14_POSITION               equ 0006h
WDTPSH_WDTPSCNT14_SIZE                   equ 0001h
WDTPSH_WDTPSCNT14_LENGTH                 equ 0001h
WDTPSH_WDTPSCNT14_MASK                   equ 0040h
WDTPSH_WDTPSCNT15_POSN                   equ 0007h
WDTPSH_WDTPSCNT15_POSITION               equ 0007h
WDTPSH_WDTPSCNT15_SIZE                   equ 0001h
WDTPSH_WDTPSCNT15_LENGTH                 equ 0001h
WDTPSH_WDTPSCNT15_MASK                   equ 0080h

