GopalSaraf/Practicals/PSDL/include/proc/pic18lf65k40.inc
// Register: SMT2CPWU
#define SMT2CPWU SMT2CPWU
SMT2CPWU                                 equ 0F00h
// bitfield definitions
SMT2CPWU_SMT2CPW_POSN                    equ 0000h
SMT2CPWU_SMT2CPW_POSITION                equ 0000h
SMT2CPWU_SMT2CPW_SIZE                    equ 0008h
SMT2CPWU_SMT2CPW_LENGTH                  equ 0008h
SMT2CPWU_SMT2CPW_MASK                    equ 00FFh
SMT2CPWU_SMT2CPW16_POSN                  equ 0000h
SMT2CPWU_SMT2CPW16_POSITION              equ 0000h
SMT2CPWU_SMT2CPW16_SIZE                  equ 0001h
SMT2CPWU_SMT2CPW16_LENGTH                equ 0001h
SMT2CPWU_SMT2CPW16_MASK                  equ 0001h
SMT2CPWU_SMT2CPW17_POSN                  equ 0001h
SMT2CPWU_SMT2CPW17_POSITION              equ 0001h
SMT2CPWU_SMT2CPW17_SIZE                  equ 0001h
SMT2CPWU_SMT2CPW17_LENGTH                equ 0001h
SMT2CPWU_SMT2CPW17_MASK                  equ 0002h
SMT2CPWU_SMT2CPW18_POSN                  equ 0002h
SMT2CPWU_SMT2CPW18_POSITION              equ 0002h
SMT2CPWU_SMT2CPW18_SIZE                  equ 0001h
SMT2CPWU_SMT2CPW18_LENGTH                equ 0001h
SMT2CPWU_SMT2CPW18_MASK                  equ 0004h
SMT2CPWU_SMT2CPW19_POSN                  equ 0003h
SMT2CPWU_SMT2CPW19_POSITION              equ 0003h
SMT2CPWU_SMT2CPW19_SIZE                  equ 0001h
SMT2CPWU_SMT2CPW19_LENGTH                equ 0001h
SMT2CPWU_SMT2CPW19_MASK                  equ 0008h
SMT2CPWU_SMT2CPW20_POSN                  equ 0004h
SMT2CPWU_SMT2CPW20_POSITION              equ 0004h
SMT2CPWU_SMT2CPW20_SIZE                  equ 0001h
SMT2CPWU_SMT2CPW20_LENGTH                equ 0001h
SMT2CPWU_SMT2CPW20_MASK                  equ 0010h
SMT2CPWU_SMT2CPW21_POSN                  equ 0005h
SMT2CPWU_SMT2CPW21_POSITION              equ 0005h
SMT2CPWU_SMT2CPW21_SIZE                  equ 0001h
SMT2CPWU_SMT2CPW21_LENGTH                equ 0001h
SMT2CPWU_SMT2CPW21_MASK                  equ 0020h
SMT2CPWU_SMT2CPW22_POSN                  equ 0006h
SMT2CPWU_SMT2CPW22_POSITION              equ 0006h
SMT2CPWU_SMT2CPW22_SIZE                  equ 0001h
SMT2CPWU_SMT2CPW22_LENGTH                equ 0001h
SMT2CPWU_SMT2CPW22_MASK                  equ 0040h
SMT2CPWU_SMT2CPW23_POSN                  equ 0007h
SMT2CPWU_SMT2CPW23_POSITION              equ 0007h
SMT2CPWU_SMT2CPW23_SIZE                  equ 0001h
SMT2CPWU_SMT2CPW23_LENGTH                equ 0001h
SMT2CPWU_SMT2CPW23_MASK                  equ 0080h

// Register: SMT2PR
#define SMT2PR SMT2PR
SMT2PR                                   equ 0F01h

// Register: SMT2PRL
#define SMT2PRL SMT2PRL
SMT2PRL                                  equ 0F01h
// bitfield definitions
SMT2PRL_SMT2PR_POSN                      equ 0000h
SMT2PRL_SMT2PR_POSITION                  equ 0000h
SMT2PRL_SMT2PR_SIZE                      equ 0008h
SMT2PRL_SMT2PR_LENGTH                    equ 0008h
SMT2PRL_SMT2PR_MASK                      equ 00FFh
SMT2PRL_SMT2PR0_POSN                     equ 0000h
SMT2PRL_SMT2PR0_POSITION                 equ 0000h
SMT2PRL_SMT2PR0_SIZE                     equ 0001h
SMT2PRL_SMT2PR0_LENGTH                   equ 0001h
SMT2PRL_SMT2PR0_MASK                     equ 0001h
SMT2PRL_SMT2PR1_POSN                     equ 0001h
SMT2PRL_SMT2PR1_POSITION                 equ 0001h
SMT2PRL_SMT2PR1_SIZE                     equ 0001h
SMT2PRL_SMT2PR1_LENGTH                   equ 0001h
SMT2PRL_SMT2PR1_MASK                     equ 0002h
SMT2PRL_SMT2PR2_POSN                     equ 0002h
SMT2PRL_SMT2PR2_POSITION                 equ 0002h
SMT2PRL_SMT2PR2_SIZE                     equ 0001h
SMT2PRL_SMT2PR2_LENGTH                   equ 0001h
SMT2PRL_SMT2PR2_MASK                     equ 0004h
SMT2PRL_SMT2PR3_POSN                     equ 0003h
SMT2PRL_SMT2PR3_POSITION                 equ 0003h
SMT2PRL_SMT2PR3_SIZE                     equ 0001h
SMT2PRL_SMT2PR3_LENGTH                   equ 0001h
SMT2PRL_SMT2PR3_MASK                     equ 0008h
SMT2PRL_SMT2PR4_POSN                     equ 0004h
SMT2PRL_SMT2PR4_POSITION                 equ 0004h
SMT2PRL_SMT2PR4_SIZE                     equ 0001h
SMT2PRL_SMT2PR4_LENGTH                   equ 0001h
SMT2PRL_SMT2PR4_MASK                     equ 0010h
SMT2PRL_SMT2PR5_POSN                     equ 0005h
SMT2PRL_SMT2PR5_POSITION                 equ 0005h
SMT2PRL_SMT2PR5_SIZE                     equ 0001h
SMT2PRL_SMT2PR5_LENGTH                   equ 0001h
SMT2PRL_SMT2PR5_MASK                     equ 0020h
SMT2PRL_SMT2PR6_POSN                     equ 0006h
SMT2PRL_SMT2PR6_POSITION                 equ 0006h
SMT2PRL_SMT2PR6_SIZE                     equ 0001h
SMT2PRL_SMT2PR6_LENGTH                   equ 0001h
SMT2PRL_SMT2PR6_MASK                     equ 0040h
SMT2PRL_SMT2PR7_POSN                     equ 0007h
SMT2PRL_SMT2PR7_POSITION                 equ 0007h
SMT2PRL_SMT2PR7_SIZE                     equ 0001h
SMT2PRL_SMT2PR7_LENGTH                   equ 0001h
SMT2PRL_SMT2PR7_MASK                     equ 0080h

// Register: SMT2PRH
#define SMT2PRH SMT2PRH
SMT2PRH                                  equ 0F02h
// bitfield definitions
SMT2PRH_SMT2PR_POSN                      equ 0000h
SMT2PRH_SMT2PR_POSITION                  equ 0000h
SMT2PRH_SMT2PR_SIZE                      equ 0008h
SMT2PRH_SMT2PR_LENGTH                    equ 0008h
SMT2PRH_SMT2PR_MASK                      equ 00FFh
SMT2PRH_SMT2PR8_POSN                     equ 0000h
SMT2PRH_SMT2PR8_POSITION                 equ 0000h
SMT2PRH_SMT2PR8_SIZE                     equ 0001h
SMT2PRH_SMT2PR8_LENGTH                   equ 0001h
SMT2PRH_SMT2PR8_MASK                     equ 0001h
SMT2PRH_SMT2PR9_POSN                     equ 0001h
SMT2PRH_SMT2PR9_POSITION                 equ 0001h
SMT2PRH_SMT2PR9_SIZE                     equ 0001h
SMT2PRH_SMT2PR9_LENGTH                   equ 0001h
SMT2PRH_SMT2PR9_MASK                     equ 0002h
SMT2PRH_SMT2PR10_POSN                    equ 0002h
SMT2PRH_SMT2PR10_POSITION                equ 0002h
SMT2PRH_SMT2PR10_SIZE                    equ 0001h
SMT2PRH_SMT2PR10_LENGTH                  equ 0001h
SMT2PRH_SMT2PR10_MASK                    equ 0004h
SMT2PRH_SMT2PR11_POSN                    equ 0003h
SMT2PRH_SMT2PR11_POSITION                equ 0003h
SMT2PRH_SMT2PR11_SIZE                    equ 0001h
SMT2PRH_SMT2PR11_LENGTH                  equ 0001h
SMT2PRH_SMT2PR11_MASK                    equ 0008h
SMT2PRH_SMT2PR12_POSN                    equ 0004h
SMT2PRH_SMT2PR12_POSITION                equ 0004h
SMT2PRH_SMT2PR12_SIZE                    equ 0001h
SMT2PRH_SMT2PR12_LENGTH                  equ 0001h
SMT2PRH_SMT2PR12_MASK                    equ 0010h
SMT2PRH_SMT2PR13_POSN                    equ 0005h
SMT2PRH_SMT2PR13_POSITION                equ 0005h
SMT2PRH_SMT2PR13_SIZE                    equ 0001h
SMT2PRH_SMT2PR13_LENGTH                  equ 0001h
SMT2PRH_SMT2PR13_MASK                    equ 0020h
SMT2PRH_SMT2PR14_POSN                    equ 0006h
SMT2PRH_SMT2PR14_POSITION                equ 0006h
SMT2PRH_SMT2PR14_SIZE                    equ 0001h
SMT2PRH_SMT2PR14_LENGTH                  equ 0001h
SMT2PRH_SMT2PR14_MASK                    equ 0040h
SMT2PRH_SMT2PR15_POSN                    equ 0007h
SMT2PRH_SMT2PR15_POSITION                equ 0007h
SMT2PRH_SMT2PR15_SIZE                    equ 0001h
SMT2PRH_SMT2PR15_LENGTH                  equ 0001h
SMT2PRH_SMT2PR15_MASK                    equ 0080h

// Register: SMT2PRU
#define SMT2PRU SMT2PRU
SMT2PRU                                  equ 0F03h
// bitfield definitions
SMT2PRU_SMT2PR_POSN                      equ 0000h
SMT2PRU_SMT2PR_POSITION                  equ 0000h
SMT2PRU_SMT2PR_SIZE                      equ 0008h
SMT2PRU_SMT2PR_LENGTH                    equ 0008h
SMT2PRU_SMT2PR_MASK                      equ 00FFh
SMT2PRU_SMT2PR16_POSN                    equ 0000h
SMT2PRU_SMT2PR16_POSITION                equ 0000h
SMT2PRU_SMT2PR16_SIZE                    equ 0001h
SMT2PRU_SMT2PR16_LENGTH                  equ 0001h
SMT2PRU_SMT2PR16_MASK                    equ 0001h
SMT2PRU_SMT2PR17_POSN                    equ 0001h
SMT2PRU_SMT2PR17_POSITION                equ 0001h
SMT2PRU_SMT2PR17_SIZE                    equ 0001h
SMT2PRU_SMT2PR17_LENGTH                  equ 0001h
SMT2PRU_SMT2PR17_MASK                    equ 0002h
SMT2PRU_SMT2PR18_POSN                    equ 0002h
SMT2PRU_SMT2PR18_POSITION                equ 0002h
SMT2PRU_SMT2PR18_SIZE                    equ 0001h
SMT2PRU_SMT2PR18_LENGTH                  equ 0001h
SMT2PRU_SMT2PR18_MASK                    equ 0004h
SMT2PRU_SMT2PR19_POSN                    equ 0003h
SMT2PRU_SMT2PR19_POSITION                equ 0003h
SMT2PRU_SMT2PR19_SIZE                    equ 0001h
SMT2PRU_SMT2PR19_LENGTH                  equ 0001h
SMT2PRU_SMT2PR19_MASK                    equ 0008h
SMT2PRU_SMT2PR20_POSN                    equ 0004h
SMT2PRU_SMT2PR20_POSITION                equ 0004h
SMT2PRU_SMT2PR20_SIZE                    equ 0001h
SMT2PRU_SMT2PR20_LENGTH                  equ 0001h
SMT2PRU_SMT2PR20_MASK                    equ 0010h
SMT2PRU_SMT2PR21_POSN                    equ 0005h
SMT2PRU_SMT2PR21_POSITION                equ 0005h
SMT2PRU_SMT2PR21_SIZE                    equ 0001h
SMT2PRU_SMT2PR21_LENGTH                  equ 0001h
SMT2PRU_SMT2PR21_MASK                    equ 0020h
SMT2PRU_SMT2PR22_POSN                    equ 0006h
SMT2PRU_SMT2PR22_POSITION                equ 0006h
SMT2PRU_SMT2PR22_SIZE                    equ 0001h
SMT2PRU_SMT2PR22_LENGTH                  equ 0001h
SMT2PRU_SMT2PR22_MASK                    equ 0040h
SMT2PRU_SMT2PR23_POSN                    equ 0007h
SMT2PRU_SMT2PR23_POSITION                equ 0007h
SMT2PRU_SMT2PR23_SIZE                    equ 0001h
SMT2PRU_SMT2PR23_LENGTH                  equ 0001h
SMT2PRU_SMT2PR23_MASK                    equ 0080h

// Register: SMT2CON0
#define SMT2CON0 SMT2CON0
SMT2CON0                                 equ 0F04h
// bitfield definitions
SMT2CON0_SMT2PS_POSN                     equ 0000h
SMT2CON0_SMT2PS_POSITION                 equ 0000h
SMT2CON0_SMT2PS_SIZE                     equ 0002h
SMT2CON0_SMT2PS_LENGTH                   equ 0002h
SMT2CON0_SMT2PS_MASK                     equ 0003h
SMT2CON0_CPOL_POSN                       equ 0002h
SMT2CON0_CPOL_POSITION                   equ 0002h
SMT2CON0_CPOL_SIZE                       equ 0001h
SMT2CON0_CPOL_LENGTH                     equ 0001h
SMT2CON0_CPOL_MASK                       equ 0004h
SMT2CON0_SPOL_POSN                       equ 0003h
SMT2CON0_SPOL_POSITION                   equ 0003h
SMT2CON0_SPOL_SIZE                       equ 0001h
SMT2CON0_SPOL_LENGTH                     equ 0001h
SMT2CON0_SPOL_MASK                       equ 0008h
SMT2CON0_WPOL_POSN                       equ 0004h
SMT2CON0_WPOL_POSITION                   equ 0004h
SMT2CON0_WPOL_SIZE                       equ 0001h
SMT2CON0_WPOL_LENGTH                     equ 0001h
SMT2CON0_WPOL_MASK                       equ 0010h
SMT2CON0_STP_POSN                        equ 0005h
SMT2CON0_STP_POSITION                    equ 0005h
SMT2CON0_STP_SIZE                        equ 0001h
SMT2CON0_STP_LENGTH                      equ 0001h
SMT2CON0_STP_MASK                        equ 0020h
SMT2CON0_EN_POSN                         equ 0007h
SMT2CON0_EN_POSITION                     equ 0007h
SMT2CON0_EN_SIZE                         equ 0001h
SMT2CON0_EN_LENGTH                       equ 0001h
SMT2CON0_EN_MASK                         equ 0080h
SMT2CON0_SMT2PS0_POSN                    equ 0000h
SMT2CON0_SMT2PS0_POSITION                equ 0000h
SMT2CON0_SMT2PS0_SIZE                    equ 0001h
SMT2CON0_SMT2PS0_LENGTH                  equ 0001h
SMT2CON0_SMT2PS0_MASK                    equ 0001h
SMT2CON0_SMT2PS1_POSN                    equ 0001h
SMT2CON0_SMT2PS1_POSITION                equ 0001h
SMT2CON0_SMT2PS1_SIZE                    equ 0001h
SMT2CON0_SMT2PS1_LENGTH                  equ 0001h
SMT2CON0_SMT2PS1_MASK                    equ 0002h

