GopalSaraf/Practicals/PSDL/include/proc/pic18lf65k40.inc
// Register: CCP4CAP
#define CCP4CAP CCP4CAP
CCP4CAP                                  equ 0F23h
// bitfield definitions
CCP4CAP_CTS_POSN                         equ 0000h
CCP4CAP_CTS_POSITION                     equ 0000h
CCP4CAP_CTS_SIZE                         equ 0008h
CCP4CAP_CTS_LENGTH                       equ 0008h
CCP4CAP_CTS_MASK                         equ 00FFh
CCP4CAP_CTS0_POSN                        equ 0000h
CCP4CAP_CTS0_POSITION                    equ 0000h
CCP4CAP_CTS0_SIZE                        equ 0001h
CCP4CAP_CTS0_LENGTH                      equ 0001h
CCP4CAP_CTS0_MASK                        equ 0001h
CCP4CAP_CTS1_POSN                        equ 0001h
CCP4CAP_CTS1_POSITION                    equ 0001h
CCP4CAP_CTS1_SIZE                        equ 0001h
CCP4CAP_CTS1_LENGTH                      equ 0001h
CCP4CAP_CTS1_MASK                        equ 0002h
CCP4CAP_CTS2_POSN                        equ 0002h
CCP4CAP_CTS2_POSITION                    equ 0002h
CCP4CAP_CTS2_SIZE                        equ 0001h
CCP4CAP_CTS2_LENGTH                      equ 0001h
CCP4CAP_CTS2_MASK                        equ 0004h
CCP4CAP_CTS3_POSN                        equ 0003h
CCP4CAP_CTS3_POSITION                    equ 0003h
CCP4CAP_CTS3_SIZE                        equ 0001h
CCP4CAP_CTS3_LENGTH                      equ 0001h
CCP4CAP_CTS3_MASK                        equ 0008h
CCP4CAP_CTS4_POSN                        equ 0004h
CCP4CAP_CTS4_POSITION                    equ 0004h
CCP4CAP_CTS4_SIZE                        equ 0001h
CCP4CAP_CTS4_LENGTH                      equ 0001h
CCP4CAP_CTS4_MASK                        equ 0010h
CCP4CAP_CTS5_POSN                        equ 0005h
CCP4CAP_CTS5_POSITION                    equ 0005h
CCP4CAP_CTS5_SIZE                        equ 0001h
CCP4CAP_CTS5_LENGTH                      equ 0001h
CCP4CAP_CTS5_MASK                        equ 0020h
CCP4CAP_CTS6_POSN                        equ 0006h
CCP4CAP_CTS6_POSITION                    equ 0006h
CCP4CAP_CTS6_SIZE                        equ 0001h
CCP4CAP_CTS6_LENGTH                      equ 0001h
CCP4CAP_CTS6_MASK                        equ 0040h
CCP4CAP_CTS7_POSN                        equ 0007h
CCP4CAP_CTS7_POSITION                    equ 0007h
CCP4CAP_CTS7_SIZE                        equ 0001h
CCP4CAP_CTS7_LENGTH                      equ 0001h
CCP4CAP_CTS7_MASK                        equ 0080h
CCP4CAP_CCP4CTS_POSN                     equ 0000h
CCP4CAP_CCP4CTS_POSITION                 equ 0000h
CCP4CAP_CCP4CTS_SIZE                     equ 0008h
CCP4CAP_CCP4CTS_LENGTH                   equ 0008h
CCP4CAP_CCP4CTS_MASK                     equ 00FFh
CCP4CAP_CCP4CTS0_POSN                    equ 0000h
CCP4CAP_CCP4CTS0_POSITION                equ 0000h
CCP4CAP_CCP4CTS0_SIZE                    equ 0001h
CCP4CAP_CCP4CTS0_LENGTH                  equ 0001h
CCP4CAP_CCP4CTS0_MASK                    equ 0001h
CCP4CAP_CCP4CTS1_POSN                    equ 0001h
CCP4CAP_CCP4CTS1_POSITION                equ 0001h
CCP4CAP_CCP4CTS1_SIZE                    equ 0001h
CCP4CAP_CCP4CTS1_LENGTH                  equ 0001h
CCP4CAP_CCP4CTS1_MASK                    equ 0002h
CCP4CAP_CCP4CTS2_POSN                    equ 0002h
CCP4CAP_CCP4CTS2_POSITION                equ 0002h
CCP4CAP_CCP4CTS2_SIZE                    equ 0001h
CCP4CAP_CCP4CTS2_LENGTH                  equ 0001h
CCP4CAP_CCP4CTS2_MASK                    equ 0004h
CCP4CAP_CCP4CTS3_POSN                    equ 0003h
CCP4CAP_CCP4CTS3_POSITION                equ 0003h
CCP4CAP_CCP4CTS3_SIZE                    equ 0001h
CCP4CAP_CCP4CTS3_LENGTH                  equ 0001h
CCP4CAP_CCP4CTS3_MASK                    equ 0008h
CCP4CAP_CCP4CTS4_POSN                    equ 0004h
CCP4CAP_CCP4CTS4_POSITION                equ 0004h
CCP4CAP_CCP4CTS4_SIZE                    equ 0001h
CCP4CAP_CCP4CTS4_LENGTH                  equ 0001h
CCP4CAP_CCP4CTS4_MASK                    equ 0010h
CCP4CAP_CCP4CTS5_POSN                    equ 0005h
CCP4CAP_CCP4CTS5_POSITION                equ 0005h
CCP4CAP_CCP4CTS5_SIZE                    equ 0001h
CCP4CAP_CCP4CTS5_LENGTH                  equ 0001h
CCP4CAP_CCP4CTS5_MASK                    equ 0020h
CCP4CAP_CCP4CTS6_POSN                    equ 0006h
CCP4CAP_CCP4CTS6_POSITION                equ 0006h
CCP4CAP_CCP4CTS6_SIZE                    equ 0001h
CCP4CAP_CCP4CTS6_LENGTH                  equ 0001h
CCP4CAP_CCP4CTS6_MASK                    equ 0040h
CCP4CAP_CCP4CTS7_POSN                    equ 0007h
CCP4CAP_CCP4CTS7_POSITION                equ 0007h
CCP4CAP_CCP4CTS7_SIZE                    equ 0001h
CCP4CAP_CCP4CTS7_LENGTH                  equ 0001h
CCP4CAP_CCP4CTS7_MASK                    equ 0080h

// Register: CCPR3
#define CCPR3 CCPR3
CCPR3                                    equ 0F24h

// Register: CCPR3L
#define CCPR3L CCPR3L
CCPR3L                                   equ 0F24h
// bitfield definitions
CCPR3L_RL_POSN                           equ 0000h
CCPR3L_RL_POSITION                       equ 0000h
CCPR3L_RL_SIZE                           equ 0008h
CCPR3L_RL_LENGTH                         equ 0008h
CCPR3L_RL_MASK                           equ 00FFh

// Register: CCPR3H
#define CCPR3H CCPR3H
CCPR3H                                   equ 0F25h
// bitfield definitions
CCPR3H_RH_POSN                           equ 0000h
CCPR3H_RH_POSITION                       equ 0000h
CCPR3H_RH_SIZE                           equ 0008h
CCPR3H_RH_LENGTH                         equ 0008h
CCPR3H_RH_MASK                           equ 00FFh

// Register: CCP3CON
#define CCP3CON CCP3CON
CCP3CON                                  equ 0F26h
// bitfield definitions
CCP3CON_MODE_POSN                        equ 0000h
CCP3CON_MODE_POSITION                    equ 0000h
CCP3CON_MODE_SIZE                        equ 0004h
CCP3CON_MODE_LENGTH                      equ 0004h
CCP3CON_MODE_MASK                        equ 000Fh
CCP3CON_FMT_POSN                         equ 0004h
CCP3CON_FMT_POSITION                     equ 0004h
CCP3CON_FMT_SIZE                         equ 0001h
CCP3CON_FMT_LENGTH                       equ 0001h
CCP3CON_FMT_MASK                         equ 0010h
CCP3CON_OUT_POSN                         equ 0005h
CCP3CON_OUT_POSITION                     equ 0005h
CCP3CON_OUT_SIZE                         equ 0001h
CCP3CON_OUT_LENGTH                       equ 0001h
CCP3CON_OUT_MASK                         equ 0020h
CCP3CON_OE_POSN                          equ 0006h
CCP3CON_OE_POSITION                      equ 0006h
CCP3CON_OE_SIZE                          equ 0001h
CCP3CON_OE_LENGTH                        equ 0001h
CCP3CON_OE_MASK                          equ 0040h
CCP3CON_EN_POSN                          equ 0007h
CCP3CON_EN_POSITION                      equ 0007h
CCP3CON_EN_SIZE                          equ 0001h
CCP3CON_EN_LENGTH                        equ 0001h
CCP3CON_EN_MASK                          equ 0080h
CCP3CON_MODE0_POSN                       equ 0000h
CCP3CON_MODE0_POSITION                   equ 0000h
CCP3CON_MODE0_SIZE                       equ 0001h
CCP3CON_MODE0_LENGTH                     equ 0001h
CCP3CON_MODE0_MASK                       equ 0001h
CCP3CON_MODE1_POSN                       equ 0001h
CCP3CON_MODE1_POSITION                   equ 0001h
CCP3CON_MODE1_SIZE                       equ 0001h
CCP3CON_MODE1_LENGTH                     equ 0001h
CCP3CON_MODE1_MASK                       equ 0002h
CCP3CON_MODE2_POSN                       equ 0002h
CCP3CON_MODE2_POSITION                   equ 0002h
CCP3CON_MODE2_SIZE                       equ 0001h
CCP3CON_MODE2_LENGTH                     equ 0001h
CCP3CON_MODE2_MASK                       equ 0004h
CCP3CON_MODE3_POSN                       equ 0003h
CCP3CON_MODE3_POSITION                   equ 0003h
CCP3CON_MODE3_SIZE                       equ 0001h
CCP3CON_MODE3_LENGTH                     equ 0001h
CCP3CON_MODE3_MASK                       equ 0008h
CCP3CON_CCP3MODE_POSN                    equ 0000h
CCP3CON_CCP3MODE_POSITION                equ 0000h
CCP3CON_CCP3MODE_SIZE                    equ 0004h
CCP3CON_CCP3MODE_LENGTH                  equ 0004h
CCP3CON_CCP3MODE_MASK                    equ 000Fh
CCP3CON_CCP3FMT_POSN                     equ 0004h
CCP3CON_CCP3FMT_POSITION                 equ 0004h
CCP3CON_CCP3FMT_SIZE                     equ 0001h
CCP3CON_CCP3FMT_LENGTH                   equ 0001h
CCP3CON_CCP3FMT_MASK                     equ 0010h
CCP3CON_CCP3OUT_POSN                     equ 0005h
CCP3CON_CCP3OUT_POSITION                 equ 0005h
CCP3CON_CCP3OUT_SIZE                     equ 0001h
CCP3CON_CCP3OUT_LENGTH                   equ 0001h
CCP3CON_CCP3OUT_MASK                     equ 0020h
CCP3CON_CCP3OE_POSN                      equ 0006h
CCP3CON_CCP3OE_POSITION                  equ 0006h
CCP3CON_CCP3OE_SIZE                      equ 0001h
CCP3CON_CCP3OE_LENGTH                    equ 0001h
CCP3CON_CCP3OE_MASK                      equ 0040h
CCP3CON_CCP3EN_POSN                      equ 0007h
CCP3CON_CCP3EN_POSITION                  equ 0007h
CCP3CON_CCP3EN_SIZE                      equ 0001h
CCP3CON_CCP3EN_LENGTH                    equ 0001h
CCP3CON_CCP3EN_MASK                      equ 0080h
CCP3CON_CCP3MODE0_POSN                   equ 0000h
CCP3CON_CCP3MODE0_POSITION               equ 0000h
CCP3CON_CCP3MODE0_SIZE                   equ 0001h
CCP3CON_CCP3MODE0_LENGTH                 equ 0001h
CCP3CON_CCP3MODE0_MASK                   equ 0001h
CCP3CON_CCP3MODE1_POSN                   equ 0001h
CCP3CON_CCP3MODE1_POSITION               equ 0001h
CCP3CON_CCP3MODE1_SIZE                   equ 0001h
CCP3CON_CCP3MODE1_LENGTH                 equ 0001h
CCP3CON_CCP3MODE1_MASK                   equ 0002h
CCP3CON_CCP3MODE2_POSN                   equ 0002h
CCP3CON_CCP3MODE2_POSITION               equ 0002h
CCP3CON_CCP3MODE2_SIZE                   equ 0001h
CCP3CON_CCP3MODE2_LENGTH                 equ 0001h
CCP3CON_CCP3MODE2_MASK                   equ 0004h
CCP3CON_CCP3MODE3_POSN                   equ 0003h
CCP3CON_CCP3MODE3_POSITION               equ 0003h
CCP3CON_CCP3MODE3_SIZE                   equ 0001h
CCP3CON_CCP3MODE3_LENGTH                 equ 0001h
CCP3CON_CCP3MODE3_MASK                   equ 0008h

// Register: CCP3CAP
#define CCP3CAP CCP3CAP
CCP3CAP                                  equ 0F27h
// bitfield definitions
CCP3CAP_CTS_POSN                         equ 0000h
CCP3CAP_CTS_POSITION                     equ 0000h
CCP3CAP_CTS_SIZE                         equ 0008h
CCP3CAP_CTS_LENGTH                       equ 0008h
CCP3CAP_CTS_MASK                         equ 00FFh
CCP3CAP_CTS0_POSN                        equ 0000h
CCP3CAP_CTS0_POSITION                    equ 0000h
CCP3CAP_CTS0_SIZE                        equ 0001h
CCP3CAP_CTS0_LENGTH                      equ 0001h
CCP3CAP_CTS0_MASK                        equ 0001h
CCP3CAP_CTS1_POSN                        equ 0001h
CCP3CAP_CTS1_POSITION                    equ 0001h
CCP3CAP_CTS1_SIZE                        equ 0001h
CCP3CAP_CTS1_LENGTH                      equ 0001h
CCP3CAP_CTS1_MASK                        equ 0002h
CCP3CAP_CTS2_POSN                        equ 0002h
CCP3CAP_CTS2_POSITION                    equ 0002h
CCP3CAP_CTS2_SIZE                        equ 0001h
CCP3CAP_CTS2_LENGTH                      equ 0001h
CCP3CAP_CTS2_MASK                        equ 0004h
CCP3CAP_CTS3_POSN                        equ 0003h
CCP3CAP_CTS3_POSITION                    equ 0003h
CCP3CAP_CTS3_SIZE                        equ 0001h
CCP3CAP_CTS3_LENGTH                      equ 0001h
CCP3CAP_CTS3_MASK                        equ 0008h
CCP3CAP_CTS4_POSN                        equ 0004h
CCP3CAP_CTS4_POSITION                    equ 0004h
CCP3CAP_CTS4_SIZE                        equ 0001h
CCP3CAP_CTS4_LENGTH                      equ 0001h
CCP3CAP_CTS4_MASK                        equ 0010h
CCP3CAP_CTS5_POSN                        equ 0005h
CCP3CAP_CTS5_POSITION                    equ 0005h
CCP3CAP_CTS5_SIZE                        equ 0001h
CCP3CAP_CTS5_LENGTH                      equ 0001h
CCP3CAP_CTS5_MASK                        equ 0020h
CCP3CAP_CTS6_POSN                        equ 0006h
CCP3CAP_CTS6_POSITION                    equ 0006h
CCP3CAP_CTS6_SIZE                        equ 0001h
CCP3CAP_CTS6_LENGTH                      equ 0001h
CCP3CAP_CTS6_MASK                        equ 0040h
CCP3CAP_CTS7_POSN                        equ 0007h
CCP3CAP_CTS7_POSITION                    equ 0007h
CCP3CAP_CTS7_SIZE                        equ 0001h
CCP3CAP_CTS7_LENGTH                      equ 0001h
CCP3CAP_CTS7_MASK                        equ 0080h
CCP3CAP_CCP3CTS_POSN                     equ 0000h
CCP3CAP_CCP3CTS_POSITION                 equ 0000h
CCP3CAP_CCP3CTS_SIZE                     equ 0008h
CCP3CAP_CCP3CTS_LENGTH                   equ 0008h
CCP3CAP_CCP3CTS_MASK                     equ 00FFh
CCP3CAP_CCP3CTS0_POSN                    equ 0000h
CCP3CAP_CCP3CTS0_POSITION                equ 0000h
CCP3CAP_CCP3CTS0_SIZE                    equ 0001h
CCP3CAP_CCP3CTS0_LENGTH                  equ 0001h
CCP3CAP_CCP3CTS0_MASK                    equ 0001h
CCP3CAP_CCP3CTS1_POSN                    equ 0001h
CCP3CAP_CCP3CTS1_POSITION                equ 0001h
CCP3CAP_CCP3CTS1_SIZE                    equ 0001h
CCP3CAP_CCP3CTS1_LENGTH                  equ 0001h
CCP3CAP_CCP3CTS1_MASK                    equ 0002h
CCP3CAP_CCP3CTS2_POSN                    equ 0002h
CCP3CAP_CCP3CTS2_POSITION                equ 0002h
CCP3CAP_CCP3CTS2_SIZE                    equ 0001h
CCP3CAP_CCP3CTS2_LENGTH                  equ 0001h
CCP3CAP_CCP3CTS2_MASK                    equ 0004h
CCP3CAP_CCP3CTS3_POSN                    equ 0003h
CCP3CAP_CCP3CTS3_POSITION                equ 0003h
CCP3CAP_CCP3CTS3_SIZE                    equ 0001h
CCP3CAP_CCP3CTS3_LENGTH                  equ 0001h
CCP3CAP_CCP3CTS3_MASK                    equ 0008h
CCP3CAP_CCP3CTS4_POSN                    equ 0004h
CCP3CAP_CCP3CTS4_POSITION                equ 0004h
CCP3CAP_CCP3CTS4_SIZE                    equ 0001h
CCP3CAP_CCP3CTS4_LENGTH                  equ 0001h
CCP3CAP_CCP3CTS4_MASK                    equ 0010h
CCP3CAP_CCP3CTS5_POSN                    equ 0005h
CCP3CAP_CCP3CTS5_POSITION                equ 0005h
CCP3CAP_CCP3CTS5_SIZE                    equ 0001h
CCP3CAP_CCP3CTS5_LENGTH                  equ 0001h
CCP3CAP_CCP3CTS5_MASK                    equ 0020h
CCP3CAP_CCP3CTS6_POSN                    equ 0006h
CCP3CAP_CCP3CTS6_POSITION                equ 0006h
CCP3CAP_CCP3CTS6_SIZE                    equ 0001h
CCP3CAP_CCP3CTS6_LENGTH                  equ 0001h
CCP3CAP_CCP3CTS6_MASK                    equ 0040h
CCP3CAP_CCP3CTS7_POSN                    equ 0007h
CCP3CAP_CCP3CTS7_POSITION                equ 0007h
CCP3CAP_CCP3CTS7_SIZE                    equ 0001h
CCP3CAP_CCP3CTS7_LENGTH                  equ 0001h
CCP3CAP_CCP3CTS7_MASK                    equ 0080h

// Register: T8TMR
#define T8TMR T8TMR
T8TMR                                    equ 0F28h
// bitfield definitions
T8TMR_TMR_POSN                           equ 0000h
T8TMR_TMR_POSITION                       equ 0000h
T8TMR_TMR_SIZE                           equ 0008h
T8TMR_TMR_LENGTH                         equ 0008h
T8TMR_TMR_MASK                           equ 00FFh
T8TMR_TMR8_POSN                          equ 0000h
T8TMR_TMR8_POSITION                      equ 0000h
T8TMR_TMR8_SIZE                          equ 0008h
T8TMR_TMR8_LENGTH                        equ 0008h
T8TMR_TMR8_MASK                          equ 00FFh

// Register: T8PR
#define T8PR T8PR
T8PR                                     equ 0F29h
// bitfield definitions
T8PR_PR_POSN                             equ 0000h
T8PR_PR_POSITION                         equ 0000h
T8PR_PR_SIZE                             equ 0008h
T8PR_PR_LENGTH                           equ 0008h
T8PR_PR_MASK                             equ 00FFh
T8PR_T8PR_POSN                           equ 0000h
T8PR_T8PR_POSITION                       equ 0000h
T8PR_T8PR_SIZE                           equ 0008h
T8PR_T8PR_LENGTH                         equ 0008h
T8PR_T8PR_MASK                           equ 00FFh

// Register: T8CON
#define T8CON T8CON
T8CON                                    equ 0F2Ah
// bitfield definitions
T8CON_OUTPS_POSN                         equ 0000h
T8CON_OUTPS_POSITION                     equ 0000h
T8CON_OUTPS_SIZE                         equ 0004h
T8CON_OUTPS_LENGTH                       equ 0004h
T8CON_OUTPS_MASK                         equ 000Fh
T8CON_CKPS_POSN                          equ 0004h
T8CON_CKPS_POSITION                      equ 0004h
T8CON_CKPS_SIZE                          equ 0003h
T8CON_CKPS_LENGTH                        equ 0003h
T8CON_CKPS_MASK                          equ 0070h
T8CON_ON_POSN                            equ 0007h
T8CON_ON_POSITION                        equ 0007h
T8CON_ON_SIZE                            equ 0001h
T8CON_ON_LENGTH                          equ 0001h
T8CON_ON_MASK                            equ 0080h
T8CON_OUTPS0_POSN                        equ 0000h
T8CON_OUTPS0_POSITION                    equ 0000h
T8CON_OUTPS0_SIZE                        equ 0001h
T8CON_OUTPS0_LENGTH                      equ 0001h
T8CON_OUTPS0_MASK                        equ 0001h
T8CON_OUTPS1_POSN                        equ 0001h
T8CON_OUTPS1_POSITION                    equ 0001h
T8CON_OUTPS1_SIZE                        equ 0001h
T8CON_OUTPS1_LENGTH                      equ 0001h
T8CON_OUTPS1_MASK                        equ 0002h
T8CON_OUTPS2_POSN                        equ 0002h
T8CON_OUTPS2_POSITION                    equ 0002h
T8CON_OUTPS2_SIZE                        equ 0001h
T8CON_OUTPS2_LENGTH                      equ 0001h
T8CON_OUTPS2_MASK                        equ 0004h
T8CON_OUTPS3_POSN                        equ 0003h
T8CON_OUTPS3_POSITION                    equ 0003h
T8CON_OUTPS3_SIZE                        equ 0001h
T8CON_OUTPS3_LENGTH                      equ 0001h
T8CON_OUTPS3_MASK                        equ 0008h
T8CON_CKPS0_POSN                         equ 0004h
T8CON_CKPS0_POSITION                     equ 0004h
T8CON_CKPS0_SIZE                         equ 0001h
T8CON_CKPS0_LENGTH                       equ 0001h
T8CON_CKPS0_MASK                         equ 0010h
T8CON_CKPS1_POSN                         equ 0005h
T8CON_CKPS1_POSITION                     equ 0005h
T8CON_CKPS1_SIZE                         equ 0001h
T8CON_CKPS1_LENGTH                       equ 0001h
T8CON_CKPS1_MASK                         equ 0020h
T8CON_CKPS2_POSN                         equ 0006h
T8CON_CKPS2_POSITION                     equ 0006h
T8CON_CKPS2_SIZE                         equ 0001h
T8CON_CKPS2_LENGTH                       equ 0001h
T8CON_CKPS2_MASK                         equ 0040h
T8CON_T8OUTPS_POSN                       equ 0000h
T8CON_T8OUTPS_POSITION                   equ 0000h
T8CON_T8OUTPS_SIZE                       equ 0004h
T8CON_T8OUTPS_LENGTH                     equ 0004h
T8CON_T8OUTPS_MASK                       equ 000Fh
T8CON_T8CKPS_POSN                        equ 0004h
T8CON_T8CKPS_POSITION                    equ 0004h
T8CON_T8CKPS_SIZE                        equ 0003h
T8CON_T8CKPS_LENGTH                      equ 0003h
T8CON_T8CKPS_MASK                        equ 0070h
T8CON_T8ON_POSN                          equ 0007h
T8CON_T8ON_POSITION                      equ 0007h
T8CON_T8ON_SIZE                          equ 0001h
T8CON_T8ON_LENGTH                        equ 0001h
T8CON_T8ON_MASK                          equ 0080h
T8CON_T8OUTPS0_POSN                      equ 0000h
T8CON_T8OUTPS0_POSITION                  equ 0000h
T8CON_T8OUTPS0_SIZE                      equ 0001h
T8CON_T8OUTPS0_LENGTH                    equ 0001h
T8CON_T8OUTPS0_MASK                      equ 0001h
T8CON_T8OUTPS1_POSN                      equ 0001h
T8CON_T8OUTPS1_POSITION                  equ 0001h
T8CON_T8OUTPS1_SIZE                      equ 0001h
T8CON_T8OUTPS1_LENGTH                    equ 0001h
T8CON_T8OUTPS1_MASK                      equ 0002h
T8CON_T8OUTPS2_POSN                      equ 0002h
T8CON_T8OUTPS2_POSITION                  equ 0002h
T8CON_T8OUTPS2_SIZE                      equ 0001h
T8CON_T8OUTPS2_LENGTH                    equ 0001h
T8CON_T8OUTPS2_MASK                      equ 0004h
T8CON_T8OUTPS3_POSN                      equ 0003h
T8CON_T8OUTPS3_POSITION                  equ 0003h
T8CON_T8OUTPS3_SIZE                      equ 0001h
T8CON_T8OUTPS3_LENGTH                    equ 0001h
T8CON_T8OUTPS3_MASK                      equ 0008h
T8CON_T8CKPS0_POSN                       equ 0004h
T8CON_T8CKPS0_POSITION                   equ 0004h
T8CON_T8CKPS0_SIZE                       equ 0001h
T8CON_T8CKPS0_LENGTH                     equ 0001h
T8CON_T8CKPS0_MASK                       equ 0010h
T8CON_T8CKPS1_POSN                       equ 0005h
T8CON_T8CKPS1_POSITION                   equ 0005h
T8CON_T8CKPS1_SIZE                       equ 0001h
T8CON_T8CKPS1_LENGTH                     equ 0001h
T8CON_T8CKPS1_MASK                       equ 0020h
T8CON_T8CKPS2_POSN                       equ 0006h
T8CON_T8CKPS2_POSITION                   equ 0006h
T8CON_T8CKPS2_SIZE                       equ 0001h
T8CON_T8CKPS2_LENGTH                     equ 0001h
T8CON_T8CKPS2_MASK                       equ 0040h
T8CON_TMR8ON_POSN                        equ 0007h
T8CON_TMR8ON_POSITION                    equ 0007h
T8CON_TMR8ON_SIZE                        equ 0001h
T8CON_TMR8ON_LENGTH                      equ 0001h
T8CON_TMR8ON_MASK                        equ 0080h

