GopalSaraf/Practicals/PSDL/include/proc/pic18lf65k40.inc
#define CWG1MODE0                        BANKMASK(CWG1CON0), 0, b
#define CWG1MODE1                        BANKMASK(CWG1CON0), 1, b
#define CWG1MODE2                        BANKMASK(CWG1CON0), 2, b
#define CWG1OVRA                         BANKMASK(CWG1STR), 4, b
#define CWG1OVRB                         BANKMASK(CWG1STR), 5, b
#define CWG1OVRC                         BANKMASK(CWG1STR), 6, b
#define CWG1OVRD                         BANKMASK(CWG1STR), 7, b
#define CWG1POLA                         BANKMASK(CWG1CON1), 0, b
#define CWG1POLB                         BANKMASK(CWG1CON1), 1, b
#define CWG1POLC                         BANKMASK(CWG1CON1), 2, b
#define CWG1POLD                         BANKMASK(CWG1CON1), 3, b
#define CWG1REN                          BANKMASK(CWG1AS0), 6, b
#define CWG1SHUTDOWN                     BANKMASK(CWG1AS0), 7, b
#define CWG1STRA                         BANKMASK(CWG1STR), 0, b
#define CWG1STRB                         BANKMASK(CWG1STR), 1, b
#define CWG1STRC                         BANKMASK(CWG1STR), 2, b
#define CWG1STRD                         BANKMASK(CWG1STR), 3, b
#define CWGIF                            BANKMASK(PIR8), 0, b
#define CWGINPPS0                        BANKMASK(CWG1PPS), 0, b
#define CWGINPPS1                        BANKMASK(CWG1PPS), 1, b
#define CWGINPPS2                        BANKMASK(CWG1PPS), 2, b
#define CWGINPPS3                        BANKMASK(CWG1PPS), 3, b
#define CWGINPPS4                        BANKMASK(CWG1PPS), 4, b
#define CWGMD                            BANKMASK(PMD2), 5, b
#define DA1                              BANKMASK(SSP1STAT), 5, a
#define DA2                              BANKMASK(SSP2STAT), 5, b
#define DABORT                           BANKMASK(SCANCON0), 4, b
#define DAC1EN                           BANKMASK(DAC1CON0), 7, b
#define DAC1NSS                          BANKMASK(DAC1CON0), 0, b
#define DAC1OE1                          BANKMASK(DAC1CON0), 5, b
#define DAC1OE2                          BANKMASK(DAC1CON0), 4, b
#define DAC1PSS0                         BANKMASK(DAC1CON0), 2, b
#define DAC1PSS1                         BANKMASK(DAC1CON0), 3, b
#define DAC1R0                           BANKMASK(DAC1CON1), 0, b
#define DAC1R1                           BANKMASK(DAC1CON1), 1, b
#define DAC1R2                           BANKMASK(DAC1CON1), 2, b
#define DAC1R3                           BANKMASK(DAC1CON1), 3, b
#define DAC1R4                           BANKMASK(DAC1CON1), 4, b
#define DACMD                            BANKMASK(PMD3), 6, b
#define DATA0                            BANKMASK(CRCDATL), 0, b
#define DATA1                            BANKMASK(CRCDATL), 1, b
#define DATA10                           BANKMASK(CRCDATH), 2, b
#define DATA11                           BANKMASK(CRCDATH), 3, b
#define DATA12                           BANKMASK(CRCDATH), 4, b
#define DATA13                           BANKMASK(CRCDATH), 5, b
#define DATA14                           BANKMASK(CRCDATH), 6, b
#define DATA15                           BANKMASK(CRCDATH), 7, b
#define DATA2                            BANKMASK(CRCDATL), 2, b
#define DATA3                            BANKMASK(CRCDATL), 3, b
#define DATA4                            BANKMASK(CRCDATL), 4, b
#define DATA5                            BANKMASK(CRCDATL), 5, b
#define DATA6                            BANKMASK(CRCDATL), 6, b
#define DATA7                            BANKMASK(CRCDATL), 7, b
#define DATA8                            BANKMASK(CRCDATH), 0, b
#define DATA9                            BANKMASK(CRCDATH), 1, b
#define DATA_ADDRESS1                    BANKMASK(SSP1STAT), 5, a
#define DATA_ADDRESS2                    BANKMASK(SSP2STAT), 5, b
#define DBF0                             BANKMASK(CWG1DBF), 0, b
#define DBF1                             BANKMASK(CWG1DBF), 1, b
#define DBF2                             BANKMASK(CWG1DBF), 2, b
#define DBF3                             BANKMASK(CWG1DBF), 3, b
#define DBF4                             BANKMASK(CWG1DBF), 4, b
#define DBF5                             BANKMASK(CWG1DBF), 5, b
#define DBR0                             BANKMASK(CWG1DBR), 0, b
#define DBR1                             BANKMASK(CWG1DBR), 1, b
#define DBR2                             BANKMASK(CWG1DBR), 2, b
#define DBR3                             BANKMASK(CWG1DBR), 3, b
#define DBR4                             BANKMASK(CWG1DBR), 4, b
#define DBR5                             BANKMASK(CWG1DBR), 5, b
#define DC                               BANKMASK(STATUS), 1, a
#define DIV0                             BANKMASK(CLKRCON), 0, b
#define DIV1                             BANKMASK(CLKRCON), 1, b
#define DIV2                             BANKMASK(CLKRCON), 2, b
#define DLEN0                            BANKMASK(CRCCON1), 4, b
#define DLEN1                            BANKMASK(CRCCON1), 5, b
#define DLEN2                            BANKMASK(CRCCON1), 6, b
#define DLEN3                            BANKMASK(CRCCON1), 7, b
#define DOE                              BANKMASK(CPUDOZE), 4, b
#define DONE                             BANKMASK(ADCON0), 0, a
#define DOZE0                            BANKMASK(CPUDOZE), 0, b
#define DOZE1                            BANKMASK(CPUDOZE), 1, b
#define DOZE2                            BANKMASK(CPUDOZE), 2, b
#define DOZEN                            BANKMASK(CPUDOZE), 6, b
#define DSMMD                            BANKMASK(PMD2), 3, b
#define D_A1                             BANKMASK(SSP1STAT), 5, a
#define D_A2                             BANKMASK(SSP2STAT), 5, b
#define D_NOT_A1                         BANKMASK(SSP1STAT), 5, a
#define D_NOT_A2                         BANKMASK(SSP2STAT), 5, b
#define D_nA1                            BANKMASK(SSP1STAT), 5, a
#define D_nA2                            BANKMASK(SSP2STAT), 5, b
#define EMBMD                            BANKMASK(PMD1), 0, b
#define EVPOL05                          BANKMASK(IPR5), 3, b
#define EVPOL15                          BANKMASK(IPR5), 4, b
#define EXTOEN                           BANKMASK(OSCEN), 7, b
#define EXTOR                            BANKMASK(OSCSTAT), 7, b
#define FREE                             BANKMASK(NVMCON1), 4, a
#define FRQ0                             BANKMASK(OSCFRQ), 0, b
#define FRQ1                             BANKMASK(OSCFRQ), 1, b
#define FRQ2                             BANKMASK(OSCFRQ), 2, b
#define FRQ3                             BANKMASK(OSCFRQ), 3, b
#define FULL                             BANKMASK(CRCCON0), 0, b
#define FVREN                            BANKMASK(FVRCON), 7, b
#define FVRMD                            BANKMASK(PMD0), 6, b
#define FVRRDY                           BANKMASK(FVRCON), 6, b
#define G1EN                             BANKMASK(CWG1CON0), 7, b
#define GCEN1                            BANKMASK(SSP1CON2), 7, a
#define GCEN2                            BANKMASK(SSP2CON2), 7, b
#define GIE                              BANKMASK(INTCON), 7, a
#define GIEH                             BANKMASK(INTCON), 7, a
#define GIEL                             BANKMASK(INTCON), 6, a
#define GIE_GIEH                         BANKMASK(INTCON), 7, a
#define GO_NOT_DONE                      BANKMASK(ADCON0), 0, a
#define GO_nDONE                         BANKMASK(ADCON0), 0, a
#define GSS4                             BANKMASK(T7GATE), 4, b
#define HADR0                            BANKMASK(SCANHADRL), 0, b
#define HADR1                            BANKMASK(SCANHADRL), 1, b
#define HADR10                           BANKMASK(SCANHADRH), 2, b
#define HADR11                           BANKMASK(SCANHADRH), 3, b
#define HADR12                           BANKMASK(SCANHADRH), 4, b
#define HADR13                           BANKMASK(SCANHADRH), 5, b
#define HADR14                           BANKMASK(SCANHADRH), 6, b
#define HADR15                           BANKMASK(SCANHADRH), 7, b
#define HADR16                           BANKMASK(SCANHADRU), 0, b
#define HADR17                           BANKMASK(SCANHADRU), 1, b
#define HADR18                           BANKMASK(SCANHADRU), 2, b
#define HADR19                           BANKMASK(SCANHADRU), 3, b
#define HADR2                            BANKMASK(SCANHADRL), 2, b
#define HADR20                           BANKMASK(SCANHADRU), 4, b
#define HADR21                           BANKMASK(SCANHADRU), 5, b
#define HADR3                            BANKMASK(SCANHADRL), 3, b
#define HADR4                            BANKMASK(SCANHADRL), 4, b
#define HADR5                            BANKMASK(SCANHADRL), 5, b
#define HADR6                            BANKMASK(SCANHADRL), 6, b
#define HADR7                            BANKMASK(SCANHADRL), 7, b
#define HADR8                            BANKMASK(SCANHADRH), 0, b
#define HADR9                            BANKMASK(SCANHADRH), 1, b
#define HFOEN                            BANKMASK(OSCEN), 6, b
#define HFOR                             BANKMASK(OSCSTAT), 6, b
#define HLVDEN                           BANKMASK(HLVDCON0), 7, b
#define HLVDIE                           BANKMASK(PIE2), 7, b
#define HLVDIF                           BANKMASK(PIR2), 7, b
#define HLVDINTH                         BANKMASK(HLVDCON0), 1, b
#define HLVDINTL                         BANKMASK(HLVDCON0), 0, b
#define HLVDIP                           BANKMASK(IPR2), 7, b
#define HLVDMD                           BANKMASK(PMD0), 5, b
#define HLVDOUT                          BANKMASK(HLVDCON0), 5, b
#define HLVDRDY                          BANKMASK(HLVDCON0), 4, b
#define HLVDSEL0                         BANKMASK(HLVDCON1), 0, b
#define HLVDSEL1                         BANKMASK(HLVDCON1), 1, b
#define HLVDSEL2                         BANKMASK(HLVDCON1), 2, b
#define HLVDSEL3                         BANKMASK(HLVDCON1), 3, b
#define I2C_DAT1                         BANKMASK(SSP1STAT), 5, a
#define I2C_DAT2                         BANKMASK(SSP2STAT), 5, b
#define I2C_READ1                        BANKMASK(SSP1STAT), 2, a
#define I2C_READ2                        BANKMASK(SSP2STAT), 2, b
#define I2C_START1                       BANKMASK(SSP1STAT), 3, a
#define I2C_START2                       BANKMASK(SSP2STAT), 3, b
#define IDLEN                            BANKMASK(CPUDOZE), 7, b
#define IN                               BANKMASK(CWG1CON1), 5, b
#define INLVLA0                          BANKMASK(INLVLA), 0, b
#define INLVLA1                          BANKMASK(INLVLA), 1, b
#define INLVLA2                          BANKMASK(INLVLA), 2, b
#define INLVLA3                          BANKMASK(INLVLA), 3, b
#define INLVLA4                          BANKMASK(INLVLA), 4, b
#define INLVLA5                          BANKMASK(INLVLA), 5, b
#define INLVLA6                          BANKMASK(INLVLA), 6, b
#define INLVLA7                          BANKMASK(INLVLA), 7, b
#define INLVLB0                          BANKMASK(INLVLB), 0, b
#define INLVLB1                          BANKMASK(INLVLB), 1, b
#define INLVLB2                          BANKMASK(INLVLB), 2, b
#define INLVLB3                          BANKMASK(INLVLB), 3, b
#define INLVLB4                          BANKMASK(INLVLB), 4, b
#define INLVLB5                          BANKMASK(INLVLB), 5, b
#define INLVLB6                          BANKMASK(INLVLB), 6, b
#define INLVLB7                          BANKMASK(INLVLB), 7, b
#define INLVLC0                          BANKMASK(INLVLC), 0, b
#define INLVLC1                          BANKMASK(INLVLC), 1, b
#define INLVLC2                          BANKMASK(INLVLC), 2, b
#define INLVLC3                          BANKMASK(INLVLC), 3, b
#define INLVLC4                          BANKMASK(INLVLC), 4, b
#define INLVLC5                          BANKMASK(INLVLC), 5, b
#define INLVLC6                          BANKMASK(INLVLC), 6, b
#define INLVLC7                          BANKMASK(INLVLC), 7, b
#define INLVLD0                          BANKMASK(INLVLD), 0, b
#define INLVLD1                          BANKMASK(INLVLD), 1, b
#define INLVLD2                          BANKMASK(INLVLD), 2, b
#define INLVLD3                          BANKMASK(INLVLD), 3, b
#define INLVLD4                          BANKMASK(INLVLD), 4, b
#define INLVLD5                          BANKMASK(INLVLD), 5, b
#define INLVLD6                          BANKMASK(INLVLD), 6, b
#define INLVLD7                          BANKMASK(INLVLD), 7, b
#define INLVLE0                          BANKMASK(INLVLE), 0, b
#define INLVLE1                          BANKMASK(INLVLE), 1, b
#define INLVLE2                          BANKMASK(INLVLE), 2, b
#define INLVLE3                          BANKMASK(INLVLE), 3, b
#define INLVLE4                          BANKMASK(INLVLE), 4, b
#define INLVLE5                          BANKMASK(INLVLE), 5, b
#define INLVLE6                          BANKMASK(INLVLE), 6, b
#define INLVLE7                          BANKMASK(INLVLE), 7, b
#define INLVLF0                          BANKMASK(INLVLF), 0, b
#define INLVLF1                          BANKMASK(INLVLF), 1, b
#define INLVLF2                          BANKMASK(INLVLF), 2, b
#define INLVLF3                          BANKMASK(INLVLF), 3, b
#define INLVLF4                          BANKMASK(INLVLF), 4, b
#define INLVLF5                          BANKMASK(INLVLF), 5, b
#define INLVLF6                          BANKMASK(INLVLF), 6, b
#define INLVLF7                          BANKMASK(INLVLF), 7, b
#define INLVLG0                          BANKMASK(INLVLG), 0, b
#define INLVLG1                          BANKMASK(INLVLG), 1, b
#define INLVLG2                          BANKMASK(INLVLG), 2, b
#define INLVLG3                          BANKMASK(INLVLG), 3, b
#define INLVLG4                          BANKMASK(INLVLG), 4, b
#define INLVLG5                          BANKMASK(INLVLG), 5, b
#define INLVLG6                          BANKMASK(INLVLG), 6, b
#define INLVLG7                          BANKMASK(INLVLG), 7, b
#define INLVLH0                          BANKMASK(INLVLH), 0, b
#define INLVLH1                          BANKMASK(INLVLH), 1, b
#define INLVLH2                          BANKMASK(INLVLH), 2, b
#define INLVLH3                          BANKMASK(INLVLH), 3, b
#define INT0EDG                          BANKMASK(INTCON), 0, a
#define INT0IE                           BANKMASK(PIE0), 0, b
#define INT0IF                           BANKMASK(PIR0), 0, b
#define INT0IP                           BANKMASK(IPR0), 0, b
#define INT0PPS0                         BANKMASK(INT0PPS), 0, b
#define INT0PPS1                         BANKMASK(INT0PPS), 1, b
#define INT0PPS2                         BANKMASK(INT0PPS), 2, b
#define INT0PPS3                         BANKMASK(INT0PPS), 3, b
#define INT1EDG                          BANKMASK(INTCON), 1, a
#define INT1IE                           BANKMASK(PIE0), 1, b
#define INT1IF                           BANKMASK(PIR0), 1, b
#define INT1IP                           BANKMASK(IPR0), 1, b
#define INT1PPS0                         BANKMASK(INT1PPS), 0, b
#define INT1PPS1                         BANKMASK(INT1PPS), 1, b
#define INT1PPS2                         BANKMASK(INT1PPS), 2, b
#define INT1PPS3                         BANKMASK(INT1PPS), 3, b
#define INT1PPS4                         BANKMASK(INT1PPS), 4, b
#define INT2EDG                          BANKMASK(INTCON), 2, a
#define INT2IE                           BANKMASK(PIE0), 2, b
#define INT2IF                           BANKMASK(PIR0), 2, b
#define INT2IP                           BANKMASK(IPR0), 2, b
#define INT2PPS0                         BANKMASK(INT2PPS), 0, b
#define INT2PPS1                         BANKMASK(INT2PPS), 1, b
#define INT2PPS2                         BANKMASK(INT2PPS), 2, b
#define INT2PPS3                         BANKMASK(INT2PPS), 3, b
#define INT2PPS4                         BANKMASK(INT2PPS), 4, b
#define INT3EDG                          BANKMASK(INTCON), 3, a
#define INT3IE                           BANKMASK(PIE0), 3, b
#define INT3IF                           BANKMASK(PIR0), 3, b
#define INT3IP                           BANKMASK(IPR0), 3, b
#define INT3PPS0                         BANKMASK(INT3PPS), 0, b
#define INT3PPS1                         BANKMASK(INT3PPS), 1, b
#define INT3PPS2                         BANKMASK(INT3PPS), 2, b
#define INT3PPS3                         BANKMASK(INT3PPS), 3, b
#define INT3PPS4                         BANKMASK(INT3PPS), 4, b
#define INT3PPS5                         BANKMASK(INT3PPS), 5, b
#define INTH                             BANKMASK(HLVDCON0), 1, b
#define INTL                             BANKMASK(HLVDCON0), 0, b
#define INTM                             BANKMASK(SCANCON0), 3, b
#define INVALID                          BANKMASK(SCANCON0), 4, b
#define IOCBF0                           BANKMASK(IOCBF), 0, b
#define IOCBF1                           BANKMASK(IOCBF), 1, b
#define IOCBF2                           BANKMASK(IOCBF), 2, b
#define IOCBF3                           BANKMASK(IOCBF), 3, b
#define IOCBF4                           BANKMASK(IOCBF), 4, b
#define IOCBF5                           BANKMASK(IOCBF), 5, b
#define IOCBF6                           BANKMASK(IOCBF), 6, b
#define IOCBF7                           BANKMASK(IOCBF), 7, b
#define IOCBN0                           BANKMASK(IOCBN), 0, b
#define IOCBN1                           BANKMASK(IOCBN), 1, b
#define IOCBN2                           BANKMASK(IOCBN), 2, b
#define IOCBN3                           BANKMASK(IOCBN), 3, b
#define IOCBN4                           BANKMASK(IOCBN), 4, b
#define IOCBN5                           BANKMASK(IOCBN), 5, b
#define IOCBN6                           BANKMASK(IOCBN), 6, b
#define IOCBN7                           BANKMASK(IOCBN), 7, b
#define IOCBP0                           BANKMASK(IOCBP), 0, b
#define IOCBP1                           BANKMASK(IOCBP), 1, b
#define IOCBP2                           BANKMASK(IOCBP), 2, b
#define IOCBP3                           BANKMASK(IOCBP), 3, b
#define IOCBP4                           BANKMASK(IOCBP), 4, b
#define IOCBP5                           BANKMASK(IOCBP), 5, b
#define IOCBP6                           BANKMASK(IOCBP), 6, b
#define IOCBP7                           BANKMASK(IOCBP), 7, b
#define IOCCF0                           BANKMASK(IOCCF), 0, b
#define IOCCF1                           BANKMASK(IOCCF), 1, b
#define IOCCF2                           BANKMASK(IOCCF), 2, b
#define IOCCF3                           BANKMASK(IOCCF), 3, b
#define IOCCF4                           BANKMASK(IOCCF), 4, b
#define IOCCF5                           BANKMASK(IOCCF), 5, b
#define IOCCF6                           BANKMASK(IOCCF), 6, b
#define IOCCF7                           BANKMASK(IOCCF), 7, b
#define IOCCN0                           BANKMASK(IOCCN), 0, b
#define IOCCN1                           BANKMASK(IOCCN), 1, b
#define IOCCN2                           BANKMASK(IOCCN), 2, b
#define IOCCN3                           BANKMASK(IOCCN), 3, b
#define IOCCN4                           BANKMASK(IOCCN), 4, b
#define IOCCN5                           BANKMASK(IOCCN), 5, b
#define IOCCN6                           BANKMASK(IOCCN), 6, b
#define IOCCN7                           BANKMASK(IOCCN), 7, b
#define IOCCP0                           BANKMASK(IOCCP), 0, b
#define IOCCP1                           BANKMASK(IOCCP), 1, b
#define IOCCP2                           BANKMASK(IOCCP), 2, b
#define IOCCP3                           BANKMASK(IOCCP), 3, b
#define IOCCP4                           BANKMASK(IOCCP), 4, b
#define IOCCP5                           BANKMASK(IOCCP), 5, b
#define IOCCP6                           BANKMASK(IOCCP), 6, b
#define IOCCP7                           BANKMASK(IOCCP), 7, b
#define IOCEF0                           BANKMASK(IOCEF), 0, b
#define IOCEF1                           BANKMASK(IOCEF), 1, b
#define IOCEF2                           BANKMASK(IOCEF), 2, b
#define IOCEF3                           BANKMASK(IOCEF), 3, b
#define IOCEF4                           BANKMASK(IOCEF), 4, b
#define IOCEF5                           BANKMASK(IOCEF), 5, b
#define IOCEF6                           BANKMASK(IOCEF), 6, b
#define IOCEF7                           BANKMASK(IOCEF), 7, b
#define IOCEN0                           BANKMASK(IOCEN), 0, b
#define IOCEN1                           BANKMASK(IOCEN), 1, b
#define IOCEN2                           BANKMASK(IOCEN), 2, b
#define IOCEN3                           BANKMASK(IOCEN), 3, b
#define IOCEN4                           BANKMASK(IOCEN), 4, b
#define IOCEN5                           BANKMASK(IOCEN), 5, b
#define IOCEN6                           BANKMASK(IOCEN), 6, b
#define IOCEN7                           BANKMASK(IOCEN), 7, b
#define IOCEP0                           BANKMASK(IOCEP), 0, b
#define IOCEP1                           BANKMASK(IOCEP), 1, b
#define IOCEP2                           BANKMASK(IOCEP), 2, b
#define IOCEP3                           BANKMASK(IOCEP), 3, b
#define IOCEP4                           BANKMASK(IOCEP), 4, b
#define IOCEP5                           BANKMASK(IOCEP), 5, b
#define IOCEP6                           BANKMASK(IOCEP), 6, b
#define IOCEP7                           BANKMASK(IOCEP), 7, b
#define IOCGF5                           BANKMASK(IOCGF), 5, b
#define IOCGN5                           BANKMASK(IOCGN), 5, b
#define IOCGP5                           BANKMASK(IOCGP), 5, b
#define IOCIE                            BANKMASK(PIE0), 4, b
#define IOCIF                            BANKMASK(PIR0), 4, b
#define IOCIP                            BANKMASK(IPR0), 4, b
#define IOCMD                            BANKMASK(PMD0), 0, b
#define IPEN                             BANKMASK(INTCON), 5, a
#define LA0                              BANKMASK(LATA), 0, a
#define LA1                              BANKMASK(LATA), 1, a
#define LA2                              BANKMASK(LATA), 2, a
#define LA3                              BANKMASK(LATA), 3, a
#define LA4                              BANKMASK(LATA), 4, a
#define LA5                              BANKMASK(LATA), 5, a
#define LA6                              BANKMASK(LATA), 6, a
#define LA7                              BANKMASK(LATA), 7, a
#define LADR0                            BANKMASK(SCANLADRL), 0, b
#define LADR1                            BANKMASK(SCANLADRL), 1, b
#define LADR10                           BANKMASK(SCANLADRH), 2, b
#define LADR11                           BANKMASK(SCANLADRH), 3, b
#define LADR12                           BANKMASK(SCANLADRH), 4, b
#define LADR13                           BANKMASK(SCANLADRH), 5, b
#define LADR14                           BANKMASK(SCANLADRH), 6, b
#define LADR15                           BANKMASK(SCANLADRH), 7, b
#define LADR16                           BANKMASK(SCANLADRU), 0, b
#define LADR17                           BANKMASK(SCANLADRU), 1, b
#define LADR18                           BANKMASK(SCANLADRU), 2, b
#define LADR19                           BANKMASK(SCANLADRU), 3, b
#define LADR2                            BANKMASK(SCANLADRL), 2, b
#define LADR20                           BANKMASK(SCANLADRU), 4, b
#define LADR21                           BANKMASK(SCANLADRU), 5, b
#define LADR3                            BANKMASK(SCANLADRL), 3, b
#define LADR4                            BANKMASK(SCANLADRL), 4, b
#define LADR5                            BANKMASK(SCANLADRL), 5, b
#define LADR6                            BANKMASK(SCANLADRL), 6, b
#define LADR7                            BANKMASK(SCANLADRL), 7, b
#define LADR8                            BANKMASK(SCANLADRH), 0, b
#define LADR9                            BANKMASK(SCANLADRH), 1, b
#define LATA0                            BANKMASK(LATA), 0, a
#define LATA1                            BANKMASK(LATA), 1, a
#define LATA2                            BANKMASK(LATA), 2, a
