GopalSaraf/Practicals/PSDL/include/proc/pic18lf65k40.inc
#define LATA3                            BANKMASK(LATA), 3, a
#define LATA4                            BANKMASK(LATA), 4, a
#define LATA5                            BANKMASK(LATA), 5, a
#define LATA6                            BANKMASK(LATA), 6, a
#define LATA7                            BANKMASK(LATA), 7, a
#define LATB0                            BANKMASK(LATB), 0, a
#define LATB1                            BANKMASK(LATB), 1, a
#define LATB2                            BANKMASK(LATB), 2, a
#define LATB3                            BANKMASK(LATB), 3, a
#define LATB4                            BANKMASK(LATB), 4, a
#define LATB5                            BANKMASK(LATB), 5, a
#define LATB6                            BANKMASK(LATB), 6, a
#define LATB7                            BANKMASK(LATB), 7, a
#define LATC0                            BANKMASK(LATC), 0, a
#define LATC1                            BANKMASK(LATC), 1, a
#define LATC2                            BANKMASK(LATC), 2, a
#define LATC3                            BANKMASK(LATC), 3, a
#define LATC4                            BANKMASK(LATC), 4, a
#define LATC5                            BANKMASK(LATC), 5, a
#define LATC6                            BANKMASK(LATC), 6, a
#define LATC7                            BANKMASK(LATC), 7, a
#define LATD0                            BANKMASK(LATD), 0, a
#define LATD1                            BANKMASK(LATD), 1, a
#define LATD2                            BANKMASK(LATD), 2, a
#define LATD3                            BANKMASK(LATD), 3, a
#define LATD4                            BANKMASK(LATD), 4, a
#define LATD5                            BANKMASK(LATD), 5, a
#define LATD6                            BANKMASK(LATD), 6, a
#define LATD7                            BANKMASK(LATD), 7, a
#define LATE0                            BANKMASK(LATE), 0, a
#define LATE1                            BANKMASK(LATE), 1, a
#define LATE2                            BANKMASK(LATE), 2, a
#define LATE3                            BANKMASK(LATE), 3, a
#define LATE4                            BANKMASK(LATE), 4, a
#define LATE5                            BANKMASK(LATE), 5, a
#define LATE6                            BANKMASK(LATE), 6, a
#define LATE7                            BANKMASK(LATE), 7, a
#define LATF0                            BANKMASK(LATF), 0, a
#define LATF1                            BANKMASK(LATF), 1, a
#define LATF2                            BANKMASK(LATF), 2, a
#define LATF3                            BANKMASK(LATF), 3, a
#define LATF4                            BANKMASK(LATF), 4, a
#define LATF5                            BANKMASK(LATF), 5, a
#define LATF6                            BANKMASK(LATF), 6, a
#define LATF7                            BANKMASK(LATF), 7, a
#define LATG0                            BANKMASK(LATG), 0, a
#define LATG1                            BANKMASK(LATG), 1, a
#define LATG2                            BANKMASK(LATG), 2, a
#define LATG3                            BANKMASK(LATG), 3, a
#define LATG4                            BANKMASK(LATG), 4, a
#define LATG6                            BANKMASK(LATG), 6, a
#define LATG7                            BANKMASK(LATG), 7, a
#define LATH0                            BANKMASK(LATH), 0, a
#define LATH1                            BANKMASK(LATH), 1, a
#define LATH2                            BANKMASK(LATH), 2, a
#define LATH3                            BANKMASK(LATH), 3, a
#define LB0                              BANKMASK(LATB), 0, a
#define LB1                              BANKMASK(LATB), 1, a
#define LB2                              BANKMASK(LATB), 2, a
#define LB3                              BANKMASK(LATB), 3, a
#define LB4                              BANKMASK(LATB), 4, a
#define LB5                              BANKMASK(LATB), 5, a
#define LB6                              BANKMASK(LATB), 6, a
#define LB7                              BANKMASK(LATB), 7, a
#define LC0                              BANKMASK(LATC), 0, a
#define LC1                              BANKMASK(LATC), 1, a
#define LC2                              BANKMASK(LATC), 2, a
#define LC3                              BANKMASK(LATC), 3, a
#define LC4                              BANKMASK(LATC), 4, a
#define LC5                              BANKMASK(LATC), 5, a
#define LC6                              BANKMASK(LATC), 6, a
#define LC7                              BANKMASK(LATC), 7, a
#define LD                               BANKMASK(CWG1CON0), 6, b
#define LD0                              BANKMASK(LATD), 0, a
#define LD1                              BANKMASK(LATD), 1, a
#define LD2                              BANKMASK(LATD), 2, a
#define LD3                              BANKMASK(LATD), 3, a
#define LD4                              BANKMASK(LATD), 4, a
#define LD5                              BANKMASK(LATD), 5, a
#define LD6                              BANKMASK(LATD), 6, a
#define LD7                              BANKMASK(LATD), 7, a
#define LE0                              BANKMASK(LATE), 0, a
#define LE1                              BANKMASK(LATE), 1, a
#define LE2                              BANKMASK(LATE), 2, a
#define LE3                              BANKMASK(LATE), 3, a
#define LE4                              BANKMASK(LATE), 4, a
#define LE5                              BANKMASK(LATE), 5, a
#define LE6                              BANKMASK(LATE), 6, a
#define LE7                              BANKMASK(LATE), 7, a
#define LF0                              BANKMASK(LATF), 0, a
#define LF1                              BANKMASK(LATF), 1, a
#define LF2                              BANKMASK(LATF), 2, a
#define LF3                              BANKMASK(LATF), 3, a
#define LF4                              BANKMASK(LATF), 4, a
#define LF5                              BANKMASK(LATF), 5, a
#define LF6                              BANKMASK(LATF), 6, a
#define LF7                              BANKMASK(LATF), 7, a
#define LFOEN                            BANKMASK(OSCEN), 4, b
#define LFOR                             BANKMASK(OSCSTAT), 4, b
#define LG0                              BANKMASK(LATG), 0, a
#define LG1                              BANKMASK(LATG), 1, a
#define LG2                              BANKMASK(LATG), 2, a
#define LG3                              BANKMASK(LATG), 3, a
#define LG4                              BANKMASK(LATG), 4, a
#define LH0                              BANKMASK(LATH), 0, a
#define LH1                              BANKMASK(LATH), 1, a
#define LH2                              BANKMASK(LATH), 2, a
#define LH3                              BANKMASK(LATH), 3, a
#define LH4                              BANKMASK(LATH), 4, a
#define LH5                              BANKMASK(LATH), 5, a
#define LH6                              BANKMASK(LATH), 6, a
#define LH7                              BANKMASK(LATH), 7, a
#define LSAC0                            BANKMASK(CWG1AS0), 2, b
#define LSAC1                            BANKMASK(CWG1AS0), 3, b
#define LSBD0                            BANKMASK(CWG1AS0), 4, b
#define LSBD1                            BANKMASK(CWG1AS0), 5, b
#define LVDIN                            BANKMASK(PORTA), 5, a
#define MC1OUT                           BANKMASK(CMOUT), 0, b
#define MC2OUT                           BANKMASK(CMOUT), 1, b
#define MC3OUT                           BANKMASK(CMOUT), 2, b
#define MDBIT                            BANKMASK(MDCON0), 0, b
#define MDCARHPPS0                       BANKMASK(MDCARHPPS), 0, b
#define MDCARHPPS1                       BANKMASK(MDCARHPPS), 1, b
#define MDCARHPPS2                       BANKMASK(MDCARHPPS), 2, b
#define MDCARHPPS3                       BANKMASK(MDCARHPPS), 3, b
#define MDCARHPPS4                       BANKMASK(MDCARHPPS), 4, b
#define MDCARHPPS5                       BANKMASK(MDCARHPPS), 5, b
#define MDCARLPPS0                       BANKMASK(MDCARLPPS), 0, b
#define MDCARLPPS1                       BANKMASK(MDCARLPPS), 1, b
#define MDCARLPPS2                       BANKMASK(MDCARLPPS), 2, b
#define MDCARLPPS3                       BANKMASK(MDCARLPPS), 3, b
#define MDCARLPPS4                       BANKMASK(MDCARLPPS), 4, b
#define MDCARLPPS5                       BANKMASK(MDCARLPPS), 5, b
#define MDCHPOL                          BANKMASK(MDCON1), 5, b
#define MDCHS0                           BANKMASK(MDCARH), 0, b
#define MDCHS1                           BANKMASK(MDCARH), 1, b
#define MDCHS2                           BANKMASK(MDCARH), 2, b
#define MDCHS3                           BANKMASK(MDCARH), 3, b
#define MDCHSYNC                         BANKMASK(MDCON1), 4, b
#define MDCLPOL                          BANKMASK(MDCON1), 1, b
#define MDCLS0                           BANKMASK(MDCARL), 0, b
#define MDCLS1                           BANKMASK(MDCARL), 1, b
#define MDCLS2                           BANKMASK(MDCARL), 2, b
#define MDCLS3                           BANKMASK(MDCARL), 3, b
#define MDCLSYNC                         BANKMASK(MDCON1), 0, b
#define MDEN                             BANKMASK(MDCON0), 7, b
#define MDOPOL                           BANKMASK(MDCON0), 4, b
#define MDOUT                            BANKMASK(MDCON0), 5, b
#define MDSRCPPS0                        BANKMASK(MDSRCPPS), 0, b
#define MDSRCPPS1                        BANKMASK(MDSRCPPS), 1, b
#define MDSRCPPS2                        BANKMASK(MDSRCPPS), 2, b
#define MDSRCPPS3                        BANKMASK(MDSRCPPS), 3, b
#define MDSRCPPS4                        BANKMASK(MDSRCPPS), 4, b
#define MDSRCPPS5                        BANKMASK(MDSRCPPS), 5, b
#define MDSRCS0                          BANKMASK(MDSRC), 0, b
#define MDSRCS1                          BANKMASK(MDSRC), 1, b
#define MDSRCS2                          BANKMASK(MDSRC), 2, b
#define MDSRCS3                          BANKMASK(MDSRC), 3, b
#define MDSRCS4                          BANKMASK(MDSRC), 4, b
#define MFOEN                            BANKMASK(OSCEN), 5, b
#define MFOR                             BANKMASK(OSCSTAT), 5, b
#define MSK01                            BANKMASK(SSP1ADD), 0, a
#define MSK02                            BANKMASK(SSP2ADD), 0, b
#define MSK11                            BANKMASK(SSP1ADD), 1, a
#define MSK12                            BANKMASK(SSP2ADD), 1, b
#define MSK21                            BANKMASK(SSP1ADD), 2, a
#define MSK22                            BANKMASK(SSP2ADD), 2, b
#define MSK31                            BANKMASK(SSP1ADD), 3, a
#define MSK32                            BANKMASK(SSP2ADD), 3, b
#define MSK41                            BANKMASK(SSP1ADD), 4, a
#define MSK42                            BANKMASK(SSP2ADD), 4, b
#define MSK51                            BANKMASK(SSP1ADD), 5, a
#define MSK52                            BANKMASK(SSP2ADD), 5, b
#define MSK61                            BANKMASK(SSP1ADD), 6, a
#define MSK62                            BANKMASK(SSP2ADD), 6, b
#define MSK71                            BANKMASK(SSP1ADD), 7, a
#define MSK72                            BANKMASK(SSP2ADD), 7, b
#define MSSP1MD                          BANKMASK(PMD5), 0, b
#define MSSP2MD                          BANKMASK(PMD5), 1, b
#define NDIV0                            BANKMASK(OSCCON1), 0, b
#define NDIV1                            BANKMASK(OSCCON1), 1, b
#define NDIV2                            BANKMASK(OSCCON1), 2, b
#define NDIV3                            BANKMASK(OSCCON1), 3, b
#define NEGATIVE                         BANKMASK(STATUS), 4, a
#define NOSC0                            BANKMASK(OSCCON1), 4, b
#define NOSC1                            BANKMASK(OSCCON1), 5, b
#define NOSC2                            BANKMASK(OSCCON1), 6, b
#define NOSCR                            BANKMASK(OSCCON3), 3, b
#define NOT_ADDRESS1                     BANKMASK(SSP1STAT), 5, a
#define NOT_ADDRESS2                     BANKMASK(SSP2STAT), 5, b
#define NOT_BOR                          BANKMASK(PCON0), 0, a
#define NOT_PD                           BANKMASK(STATUS), 5, a
#define NOT_POR                          BANKMASK(PCON0), 1, a
#define NOT_RI                           BANKMASK(PCON0), 2, a
#define NOT_RMCLR                        BANKMASK(PCON0), 3, a
#define NOT_RWDT                         BANKMASK(PCON0), 4, a
#define NOT_T1SYNC                       BANKMASK(T1CON), 2, a
#define NOT_T3SYNC                       BANKMASK(T3CON), 2, a
#define NOT_T5SYNC                       BANKMASK(T5CON), 2, a
#define NOT_T7SYNC                       BANKMASK(T7CON), 2, b
#define NOT_TO                           BANKMASK(STATUS), 6, a
#define NOT_WDTWV                        BANKMASK(PCON0), 5, a
#define NOT_WRITE1                       BANKMASK(SSP1STAT), 2, a
#define NOT_WRITE2                       BANKMASK(SSP2STAT), 2, b
#define NSS                              BANKMASK(DAC1CON0), 0, b
#define NVMADR0                          BANKMASK(NVMADRL), 0, a
#define NVMADR1                          BANKMASK(NVMADRL), 1, a
#define NVMADR2                          BANKMASK(NVMADRL), 2, a
#define NVMADR3                          BANKMASK(NVMADRL), 3, a
#define NVMADR4                          BANKMASK(NVMADRL), 4, a
#define NVMADR5                          BANKMASK(NVMADRL), 5, a
#define NVMADR6                          BANKMASK(NVMADRL), 6, a
#define NVMADR7                          BANKMASK(NVMADRL), 7, a
#define NVMADR8                          BANKMASK(NVMADRH), 0, a
#define NVMADR9                          BANKMASK(NVMADRH), 1, a
#define NVMDAT0                          BANKMASK(NVMDAT), 0, a
#define NVMDAT1                          BANKMASK(NVMDAT), 1, a
#define NVMDAT2                          BANKMASK(NVMDAT), 2, a
#define NVMDAT3                          BANKMASK(NVMDAT), 3, a
#define NVMDAT4                          BANKMASK(NVMDAT), 4, a
#define NVMDAT5                          BANKMASK(NVMDAT), 5, a
#define NVMDAT6                          BANKMASK(NVMDAT), 6, a
#define NVMDAT7                          BANKMASK(NVMDAT), 7, a
#define NVMIE                            BANKMASK(PIE8), 5, b
#define NVMIF                            BANKMASK(PIR8), 5, b
#define NVMIP                            BANKMASK(IPR8), 5, b
#define NVMMD                            BANKMASK(PMD0), 2, b
#define NVMREG0                          BANKMASK(NVMCON1), 6, a
#define NVMREG1                          BANKMASK(NVMCON1), 7, a
#define ODCA0                            BANKMASK(ODCONA), 0, b
#define ODCA1                            BANKMASK(ODCONA), 1, b
#define ODCA2                            BANKMASK(ODCONA), 2, b
#define ODCA3                            BANKMASK(ODCONA), 3, b
#define ODCA4                            BANKMASK(ODCONA), 4, b
#define ODCA5                            BANKMASK(ODCONA), 5, b
#define ODCA6                            BANKMASK(ODCONA), 6, b
#define ODCA7                            BANKMASK(ODCONA), 7, b
#define ODCB0                            BANKMASK(ODCONB), 0, b
#define ODCB1                            BANKMASK(ODCONB), 1, b
#define ODCB2                            BANKMASK(ODCONB), 2, b
#define ODCB3                            BANKMASK(ODCONB), 3, b
#define ODCB4                            BANKMASK(ODCONB), 4, b
#define ODCB5                            BANKMASK(ODCONB), 5, b
#define ODCB6                            BANKMASK(ODCONB), 6, b
#define ODCB7                            BANKMASK(ODCONB), 7, b
#define ODCC0                            BANKMASK(ODCONC), 0, b
#define ODCC1                            BANKMASK(ODCONC), 1, b
#define ODCC2                            BANKMASK(ODCONC), 2, b
#define ODCC3                            BANKMASK(ODCONC), 3, b
#define ODCC4                            BANKMASK(ODCONC), 4, b
#define ODCC5                            BANKMASK(ODCONC), 5, b
#define ODCC6                            BANKMASK(ODCONC), 6, b
#define ODCC7                            BANKMASK(ODCONC), 7, b
#define ODCD0                            BANKMASK(ODCOND), 0, b
#define ODCD1                            BANKMASK(ODCOND), 1, b
#define ODCD2                            BANKMASK(ODCOND), 2, b
#define ODCD3                            BANKMASK(ODCOND), 3, b
#define ODCD4                            BANKMASK(ODCOND), 4, b
#define ODCD5                            BANKMASK(ODCOND), 5, b
#define ODCD6                            BANKMASK(ODCOND), 6, b
#define ODCD7                            BANKMASK(ODCOND), 7, b
#define ODCE0                            BANKMASK(ODCONE), 0, b
#define ODCE1                            BANKMASK(ODCONE), 1, b
#define ODCE2                            BANKMASK(ODCONE), 2, b
#define ODCE3                            BANKMASK(ODCONE), 3, b
#define ODCE4                            BANKMASK(ODCONE), 4, b
#define ODCE5                            BANKMASK(ODCONE), 5, b
#define ODCE6                            BANKMASK(ODCONE), 6, b
#define ODCE7                            BANKMASK(ODCONE), 7, b
#define ODCF0                            BANKMASK(ODCONF), 0, b
#define ODCF1                            BANKMASK(ODCONF), 1, b
#define ODCF2                            BANKMASK(ODCONF), 2, b
#define ODCF3                            BANKMASK(ODCONF), 3, b
#define ODCF4                            BANKMASK(ODCONF), 4, b
#define ODCF5                            BANKMASK(ODCONF), 5, b
#define ODCF6                            BANKMASK(ODCONF), 6, b
#define ODCF7                            BANKMASK(ODCONF), 7, b
#define ODCG0                            BANKMASK(ODCONG), 0, b
#define ODCG1                            BANKMASK(ODCONG), 1, b
#define ODCG2                            BANKMASK(ODCONG), 2, b
#define ODCG3                            BANKMASK(ODCONG), 3, b
#define ODCG4                            BANKMASK(ODCONG), 4, b
#define ODCG6                            BANKMASK(ODCONG), 6, b
#define ODCG7                            BANKMASK(ODCONG), 7, b
#define ODCH0                            BANKMASK(ODCONH), 0, b
#define ODCH1                            BANKMASK(ODCONH), 1, b
#define ODCH2                            BANKMASK(ODCONH), 2, b
#define ODCH3                            BANKMASK(ODCONH), 3, b
#define OE1                              BANKMASK(DAC1CON0), 5, b
#define OE2                              BANKMASK(DAC1CON0), 4, b
#define OPOL                             BANKMASK(MDCON0), 4, b
#define ORDY                             BANKMASK(OSCCON3), 4, b
#define OSCFIE                           BANKMASK(PIE1), 7, b
#define OSCFIF                           BANKMASK(PIR1), 7, b
#define OSCFIP                           BANKMASK(IPR1), 7, b
#define OV                               BANKMASK(STATUS), 3, a
#define OVERFLOW                         BANKMASK(STATUS), 3, a
#define OVRA                             BANKMASK(CWG1STR), 4, b
#define OVRB                             BANKMASK(CWG1STR), 5, b
#define OVRC                             BANKMASK(CWG1STR), 6, b
#define OVRD                             BANKMASK(CWG1STR), 7, b
#define P1M1                             BANKMASK(CCP1CON), 7, a
#define P6TSEL0                          BANKMASK(CCPTMRS1), 2, a
#define P6TSEL1                          BANKMASK(CCPTMRS1), 3, a
#define P7TSEL0                          BANKMASK(CCPTMRS1), 4, a
#define P7TSEL1                          BANKMASK(CCPTMRS1), 5, a
#define PA1                              BANKMASK(PORTC), 2, a
#define PA2                              BANKMASK(PORTC), 1, a
#define PA2E                             BANKMASK(PORTE), 7, a
#define PB1E                             BANKMASK(PORTE), 6, a
#define PB2                              BANKMASK(PORTE), 2, a
#define PB3E                             BANKMASK(PORTE), 4, a
#define PC1E                             BANKMASK(PORTE), 5, a
#define PC2                              BANKMASK(PORTE), 1, a
#define PC3E                             BANKMASK(PORTE), 3, a
#define PD                               BANKMASK(STATUS), 5, a
#define PD2                              BANKMASK(PORTE), 0, a
#define PEIE                             BANKMASK(INTCON), 6, a
#define PEIE_GIEL                        BANKMASK(INTCON), 6, a
#define PEN1                             BANKMASK(SSP1CON2), 2, a
#define PEN2                             BANKMASK(SSP2CON2), 2, b
#define PLEN0                            BANKMASK(CRCCON1), 0, b
#define PLEN1                            BANKMASK(CRCCON1), 1, b
#define PLEN2                            BANKMASK(CRCCON1), 2, b
#define PLEN3                            BANKMASK(CRCCON1), 3, b
#define PLLR                             BANKMASK(OSCSTAT), 0, b
#define POLA                             BANKMASK(CWG1CON1), 0, b
#define POLB                             BANKMASK(CWG1CON1), 1, b
#define POLC                             BANKMASK(CWG1CON1), 2, b
#define POLD                             BANKMASK(CWG1CON1), 3, b
#define POR                              BANKMASK(PCON0), 1, a
#define PPSLOCKED                        BANKMASK(PPSLOCK), 0, b
#define PSCNT0                           BANKMASK(WDTPSL), 0, b
#define PSCNT1                           BANKMASK(WDTPSL), 1, b
#define PSCNT10                          BANKMASK(WDTPSH), 2, b
#define PSCNT11                          BANKMASK(WDTPSH), 3, b
#define PSCNT12                          BANKMASK(WDTPSH), 4, b
#define PSCNT13                          BANKMASK(WDTPSH), 5, b
#define PSCNT14                          BANKMASK(WDTPSH), 6, b
#define PSCNT15                          BANKMASK(WDTPSH), 7, b
#define PSCNT16                          BANKMASK(WDTTMR), 0, b
#define PSCNT17                          BANKMASK(WDTTMR), 1, b
#define PSCNT2                           BANKMASK(WDTPSL), 2, b
#define PSCNT3                           BANKMASK(WDTPSL), 3, b
#define PSCNT4                           BANKMASK(WDTPSL), 4, b
#define PSCNT5                           BANKMASK(WDTPSL), 5, b
#define PSCNT6                           BANKMASK(WDTPSL), 6, b
#define PSCNT7                           BANKMASK(WDTPSL), 7, b
#define PSCNT8                           BANKMASK(WDTPSH), 0, b
#define PSCNT9                           BANKMASK(WDTPSH), 1, b
#define PSPIE                            BANKMASK(PIE1), 7, b
#define PSPIF                            BANKMASK(PIR1), 7, b
#define PSPIP                            BANKMASK(IPR1), 7, b
#define PSS0                             BANKMASK(DAC1CON0), 2, b
#define PSS1                             BANKMASK(DAC1CON0), 3, b
#define PWM6DC0                          BANKMASK(PWM6DCL), 6, a
#define PWM6DC1                          BANKMASK(PWM6DCL), 7, a
#define PWM6DC2                          BANKMASK(PWM6DCH), 0, a
#define PWM6DC3                          BANKMASK(PWM6DCH), 1, a
#define PWM6DC4                          BANKMASK(PWM6DCH), 2, a
#define PWM6DC5                          BANKMASK(PWM6DCH), 3, a
#define PWM6DC6                          BANKMASK(PWM6DCH), 4, a
#define PWM6DC7                          BANKMASK(PWM6DCH), 5, a
#define PWM6DC8                          BANKMASK(PWM6DCH), 6, a
#define PWM6DC9                          BANKMASK(PWM6DCH), 7, a
#define PWM6EN                           BANKMASK(PWM6CON), 7, a
#define PWM6MD                           BANKMASK(PMD4), 5, b
#define PWM6OE                           BANKMASK(PWM6CON), 6, a
#define PWM6OUT                          BANKMASK(PWM6CON), 5, a
#define PWM6POL                          BANKMASK(PWM6CON), 4, a
#define PWM7DC0                          BANKMASK(PWM7DCL), 6, a
#define PWM7DC1                          BANKMASK(PWM7DCL), 7, a
#define PWM7DC2                          BANKMASK(PWM7DCH), 0, a
#define PWM7DC3                          BANKMASK(PWM7DCH), 1, a
#define PWM7DC4                          BANKMASK(PWM7DCH), 2, a
#define PWM7DC5                          BANKMASK(PWM7DCH), 3, a
