GopalSaraf/Practicals/PSDL/include/proc/pic18lf65k40.inc
#define SMT1PRAIP                        BANKMASK(IPR9), 1, b
#define SMT1PS0                          BANKMASK(SMT1CON0), 0, b
#define SMT1PS1                          BANKMASK(SMT1CON0), 1, b
#define SMT1PWAIE                        BANKMASK(PIE9), 2, b
#define SMT1PWAIF                        BANKMASK(PIR9), 2, b
#define SMT1PWAIP                        BANKMASK(IPR9), 2, b
#define SMT1REPEAT                       BANKMASK(SMT1CON1), 6, b
#define SMT1RESET                        BANKMASK(SMT1STAT), 5, b
#define SMT1SIGPPS0                      BANKMASK(SMT1SIGPPS), 0, b
#define SMT1SIGPPS1                      BANKMASK(SMT1SIGPPS), 1, b
#define SMT1SIGPPS2                      BANKMASK(SMT1SIGPPS), 2, b
#define SMT1SIGPPS3                      BANKMASK(SMT1SIGPPS), 3, b
#define SMT1SIGPPS4                      BANKMASK(SMT1SIGPPS), 4, b
#define SMT1SIGPPS5                      BANKMASK(SMT1SIGPPS), 5, b
#define SMT1SSEL0                        BANKMASK(SMT1SIG), 0, b
#define SMT1SSEL1                        BANKMASK(SMT1SIG), 1, b
#define SMT1SSEL2                        BANKMASK(SMT1SIG), 2, b
#define SMT1SSEL3                        BANKMASK(SMT1SIG), 3, b
#define SMT1SSEL4                        BANKMASK(SMT1SIG), 4, b
#define SMT1TMR0                         BANKMASK(SMT1TMRL), 0, b
#define SMT1TMR1                         BANKMASK(SMT1TMRL), 1, b
#define SMT1TMR10                        BANKMASK(SMT1TMRH), 2, b
#define SMT1TMR11                        BANKMASK(SMT1TMRH), 3, b
#define SMT1TMR12                        BANKMASK(SMT1TMRH), 4, b
#define SMT1TMR13                        BANKMASK(SMT1TMRH), 5, b
#define SMT1TMR14                        BANKMASK(SMT1TMRH), 6, b
#define SMT1TMR15                        BANKMASK(SMT1TMRH), 7, b
#define SMT1TMR16                        BANKMASK(SMT1TMRU), 0, b
#define SMT1TMR17                        BANKMASK(SMT1TMRU), 1, b
#define SMT1TMR18                        BANKMASK(SMT1TMRU), 2, b
#define SMT1TMR19                        BANKMASK(SMT1TMRU), 3, b
#define SMT1TMR2                         BANKMASK(SMT1TMRL), 2, b
#define SMT1TMR20                        BANKMASK(SMT1TMRU), 4, b
#define SMT1TMR21                        BANKMASK(SMT1TMRU), 5, b
#define SMT1TMR22                        BANKMASK(SMT1TMRU), 6, b
#define SMT1TMR23                        BANKMASK(SMT1TMRU), 7, b
#define SMT1TMR3                         BANKMASK(SMT1TMRL), 3, b
#define SMT1TMR4                         BANKMASK(SMT1TMRL), 4, b
#define SMT1TMR5                         BANKMASK(SMT1TMRL), 5, b
#define SMT1TMR6                         BANKMASK(SMT1TMRL), 6, b
#define SMT1TMR7                         BANKMASK(SMT1TMRL), 7, b
#define SMT1TMR8                         BANKMASK(SMT1TMRH), 0, b
#define SMT1TMR9                         BANKMASK(SMT1TMRH), 1, b
#define SMT1TS                           BANKMASK(SMT1STAT), 2, b
#define SMT1WINPPS0                      BANKMASK(SMT1WINPPS), 0, b
#define SMT1WINPPS1                      BANKMASK(SMT1WINPPS), 1, b
#define SMT1WINPPS2                      BANKMASK(SMT1WINPPS), 2, b
#define SMT1WINPPS3                      BANKMASK(SMT1WINPPS), 3, b
#define SMT1WINPPS4                      BANKMASK(SMT1WINPPS), 4, b
#define SMT1WINPPS5                      BANKMASK(SMT1WINPPS), 5, b
#define SMT1WS                           BANKMASK(SMT1STAT), 1, b
#define SMT1WSEL0                        BANKMASK(SMT1WIN), 0, b
#define SMT1WSEL1                        BANKMASK(SMT1WIN), 1, b
#define SMT1WSEL2                        BANKMASK(SMT1WIN), 2, b
#define SMT1WSEL3                        BANKMASK(SMT1WIN), 3, b
#define SMT1WSEL4                        BANKMASK(SMT1WIN), 4, b
#define SMT2AS                           BANKMASK(SMT2STAT), 0, b
#define SMT2CPR0                         BANKMASK(SMT2CPRL), 0, b
#define SMT2CPR1                         BANKMASK(SMT2CPRL), 1, b
#define SMT2CPR10                        BANKMASK(SMT2CPRH), 2, b
#define SMT2CPR11                        BANKMASK(SMT2CPRH), 3, b
#define SMT2CPR12                        BANKMASK(SMT2CPRH), 4, b
#define SMT2CPR13                        BANKMASK(SMT2CPRH), 5, b
#define SMT2CPR14                        BANKMASK(SMT2CPRH), 6, b
#define SMT2CPR15                        BANKMASK(SMT2CPRH), 7, b
#define SMT2CPR16                        BANKMASK(SMT2CPRU), 0, b
#define SMT2CPR17                        BANKMASK(SMT2CPRU), 1, b
#define SMT2CPR18                        BANKMASK(SMT2CPRU), 2, b
#define SMT2CPR19                        BANKMASK(SMT2CPRU), 3, b
#define SMT2CPR2                         BANKMASK(SMT2CPRL), 2, b
#define SMT2CPR20                        BANKMASK(SMT2CPRU), 4, b
#define SMT2CPR21                        BANKMASK(SMT2CPRU), 5, b
#define SMT2CPR22                        BANKMASK(SMT2CPRU), 6, b
#define SMT2CPR23                        BANKMASK(SMT2CPRU), 7, b
#define SMT2CPR3                         BANKMASK(SMT2CPRL), 3, b
#define SMT2CPR4                         BANKMASK(SMT2CPRL), 4, b
#define SMT2CPR5                         BANKMASK(SMT2CPRL), 5, b
#define SMT2CPR6                         BANKMASK(SMT2CPRL), 6, b
#define SMT2CPR7                         BANKMASK(SMT2CPRL), 7, b
#define SMT2CPR8                         BANKMASK(SMT2CPRH), 0, b
#define SMT2CPR9                         BANKMASK(SMT2CPRH), 1, b
#define SMT2CPRUP                        BANKMASK(SMT2STAT), 7, b
#define SMT2CPW0                         BANKMASK(SMT2CPWL), 0, b
#define SMT2CPW1                         BANKMASK(SMT2CPWL), 1, b
#define SMT2CPW10                        BANKMASK(SMT2CPWH), 2, b
#define SMT2CPW11                        BANKMASK(SMT2CPWH), 3, b
#define SMT2CPW12                        BANKMASK(SMT2CPWH), 4, b
#define SMT2CPW13                        BANKMASK(SMT2CPWH), 5, b
#define SMT2CPW14                        BANKMASK(SMT2CPWH), 6, b
#define SMT2CPW15                        BANKMASK(SMT2CPWH), 7, b
#define SMT2CPW16                        BANKMASK(SMT2CPWU), 0, b
#define SMT2CPW17                        BANKMASK(SMT2CPWU), 1, b
#define SMT2CPW18                        BANKMASK(SMT2CPWU), 2, b
#define SMT2CPW19                        BANKMASK(SMT2CPWU), 3, b
#define SMT2CPW2                         BANKMASK(SMT2CPWL), 2, b
#define SMT2CPW20                        BANKMASK(SMT2CPWU), 4, b
#define SMT2CPW21                        BANKMASK(SMT2CPWU), 5, b
#define SMT2CPW22                        BANKMASK(SMT2CPWU), 6, b
#define SMT2CPW23                        BANKMASK(SMT2CPWU), 7, b
#define SMT2CPW3                         BANKMASK(SMT2CPWL), 3, b
#define SMT2CPW4                         BANKMASK(SMT2CPWL), 4, b
#define SMT2CPW5                         BANKMASK(SMT2CPWL), 5, b
#define SMT2CPW6                         BANKMASK(SMT2CPWL), 6, b
#define SMT2CPW7                         BANKMASK(SMT2CPWL), 7, b
#define SMT2CPW8                         BANKMASK(SMT2CPWH), 0, b
#define SMT2CPW9                         BANKMASK(SMT2CPWH), 1, b
#define SMT2CPWUP                        BANKMASK(SMT2STAT), 6, b
#define SMT2CSEL0                        BANKMASK(SMT2CLK), 0, b
#define SMT2CSEL1                        BANKMASK(SMT2CLK), 1, b
#define SMT2CSEL2                        BANKMASK(SMT2CLK), 2, b
#define SMT2GO                           BANKMASK(SMT2CON1), 7, b
#define SMT2IE                           BANKMASK(PIE9), 3, b
#define SMT2IF                           BANKMASK(PIR9), 3, b
#define SMT2IP                           BANKMASK(IPR9), 3, b
#define SMT2MODE0                        BANKMASK(SMT2CON1), 0, b
#define SMT2MODE1                        BANKMASK(SMT2CON1), 1, b
#define SMT2MODE2                        BANKMASK(SMT2CON1), 2, b
#define SMT2MODE3                        BANKMASK(SMT2CON1), 3, b
#define SMT2PR0                          BANKMASK(SMT2PRL), 0, b
#define SMT2PR1                          BANKMASK(SMT2PRL), 1, b
#define SMT2PR10                         BANKMASK(SMT2PRH), 2, b
#define SMT2PR11                         BANKMASK(SMT2PRH), 3, b
#define SMT2PR12                         BANKMASK(SMT2PRH), 4, b
#define SMT2PR13                         BANKMASK(SMT2PRH), 5, b
#define SMT2PR14                         BANKMASK(SMT2PRH), 6, b
#define SMT2PR15                         BANKMASK(SMT2PRH), 7, b
#define SMT2PR16                         BANKMASK(SMT2PRU), 0, b
#define SMT2PR17                         BANKMASK(SMT2PRU), 1, b
#define SMT2PR18                         BANKMASK(SMT2PRU), 2, b
#define SMT2PR19                         BANKMASK(SMT2PRU), 3, b
#define SMT2PR2                          BANKMASK(SMT2PRL), 2, b
#define SMT2PR20                         BANKMASK(SMT2PRU), 4, b
#define SMT2PR21                         BANKMASK(SMT2PRU), 5, b
#define SMT2PR22                         BANKMASK(SMT2PRU), 6, b
#define SMT2PR23                         BANKMASK(SMT2PRU), 7, b
#define SMT2PR3                          BANKMASK(SMT2PRL), 3, b
#define SMT2PR4                          BANKMASK(SMT2PRL), 4, b
#define SMT2PR5                          BANKMASK(SMT2PRL), 5, b
#define SMT2PR6                          BANKMASK(SMT2PRL), 6, b
#define SMT2PR7                          BANKMASK(SMT2PRL), 7, b
#define SMT2PR8                          BANKMASK(SMT2PRH), 0, b
#define SMT2PR9                          BANKMASK(SMT2PRH), 1, b
#define SMT2PRAIE                        BANKMASK(PIE9), 4, b
#define SMT2PRAIF                        BANKMASK(PIR9), 4, b
#define SMT2PRAIP                        BANKMASK(IPR9), 4, b
#define SMT2PS0                          BANKMASK(SMT2CON0), 0, b
#define SMT2PS1                          BANKMASK(SMT2CON0), 1, b
#define SMT2PWAIE                        BANKMASK(PIE9), 5, b
#define SMT2PWAIF                        BANKMASK(PIR9), 5, b
#define SMT2PWAIP                        BANKMASK(IPR9), 5, b
#define SMT2REPEAT                       BANKMASK(SMT2CON1), 6, b
#define SMT2RESET                        BANKMASK(SMT2STAT), 5, b
#define SMT2SIGPPS0                      BANKMASK(SMT2SIGPPS), 0, b
#define SMT2SIGPPS1                      BANKMASK(SMT2SIGPPS), 1, b
#define SMT2SIGPPS2                      BANKMASK(SMT2SIGPPS), 2, b
#define SMT2SIGPPS3                      BANKMASK(SMT2SIGPPS), 3, b
#define SMT2SIGPPS4                      BANKMASK(SMT2SIGPPS), 4, b
#define SMT2SIGPPS5                      BANKMASK(SMT2SIGPPS), 5, b
#define SMT2SSEL0                        BANKMASK(SMT2SIG), 0, b
#define SMT2SSEL1                        BANKMASK(SMT2SIG), 1, b
#define SMT2SSEL2                        BANKMASK(SMT2SIG), 2, b
#define SMT2SSEL3                        BANKMASK(SMT2SIG), 3, b
#define SMT2SSEL4                        BANKMASK(SMT2SIG), 4, b
#define SMT2TMR0                         BANKMASK(SMT2TMRL), 0, b
#define SMT2TMR1                         BANKMASK(SMT2TMRL), 1, b
#define SMT2TMR10                        BANKMASK(SMT2TMRH), 2, b
#define SMT2TMR11                        BANKMASK(SMT2TMRH), 3, b
#define SMT2TMR12                        BANKMASK(SMT2TMRH), 4, b
#define SMT2TMR13                        BANKMASK(SMT2TMRH), 5, b
#define SMT2TMR14                        BANKMASK(SMT2TMRH), 6, b
#define SMT2TMR15                        BANKMASK(SMT2TMRH), 7, b
#define SMT2TMR16                        BANKMASK(SMT2TMRU), 0, b
#define SMT2TMR17                        BANKMASK(SMT2TMRU), 1, b
#define SMT2TMR18                        BANKMASK(SMT2TMRU), 2, b
#define SMT2TMR19                        BANKMASK(SMT2TMRU), 3, b
#define SMT2TMR2                         BANKMASK(SMT2TMRL), 2, b
#define SMT2TMR20                        BANKMASK(SMT2TMRU), 4, b
#define SMT2TMR21                        BANKMASK(SMT2TMRU), 5, b
#define SMT2TMR22                        BANKMASK(SMT2TMRU), 6, b
#define SMT2TMR23                        BANKMASK(SMT2TMRU), 7, b
#define SMT2TMR3                         BANKMASK(SMT2TMRL), 3, b
#define SMT2TMR4                         BANKMASK(SMT2TMRL), 4, b
#define SMT2TMR5                         BANKMASK(SMT2TMRL), 5, b
#define SMT2TMR6                         BANKMASK(SMT2TMRL), 6, b
#define SMT2TMR7                         BANKMASK(SMT2TMRL), 7, b
#define SMT2TMR8                         BANKMASK(SMT2TMRH), 0, b
#define SMT2TMR9                         BANKMASK(SMT2TMRH), 1, b
#define SMT2TS                           BANKMASK(SMT2STAT), 2, b
#define SMT2WINPPS0                      BANKMASK(SMT2WINPPS), 0, b
#define SMT2WINPPS1                      BANKMASK(SMT2WINPPS), 1, b
#define SMT2WINPPS2                      BANKMASK(SMT2WINPPS), 2, b
#define SMT2WINPPS3                      BANKMASK(SMT2WINPPS), 3, b
#define SMT2WINPPS4                      BANKMASK(SMT2WINPPS), 4, b
#define SMT2WINPPS5                      BANKMASK(SMT2WINPPS), 5, b
#define SMT2WS                           BANKMASK(SMT2STAT), 1, b
#define SMT2WSEL0                        BANKMASK(SMT2WIN), 0, b
#define SMT2WSEL1                        BANKMASK(SMT2WIN), 1, b
#define SMT2WSEL2                        BANKMASK(SMT2WIN), 2, b
#define SMT2WSEL3                        BANKMASK(SMT2WIN), 3, b
#define SMT2WSEL4                        BANKMASK(SMT2WIN), 4, b
#define SMU1MD                           BANKMASK(PMD2), 1, b
#define SMU2MD                           BANKMASK(PMD2), 2, b
#define SOR                              BANKMASK(OSCSTAT), 3, b
#define SOSCEN                           BANKMASK(OSCEN), 3, b
#define SOSCPWR                          BANKMASK(OSCCON3), 6, b
#define SP0                              BANKMASK(STKPTR), 0, a
#define SP1                              BANKMASK(STKPTR), 1, a
#define SP2                              BANKMASK(STKPTR), 2, a
#define SP3                              BANKMASK(STKPTR), 3, a
#define SP4                              BANKMASK(STKPTR), 4, a
#define SP5                              BANKMASK(STKPTR), 5, a
#define SPI1MD                           BANKMASK(PMD0), 1, b
#define SPI2MD                           BANKMASK(PMD0), 2, b
#define SRCS0                            BANKMASK(MDSRC), 0, b
#define SRCS1                            BANKMASK(MDSRC), 1, b
#define SRCS2                            BANKMASK(MDSRC), 2, b
#define SRCS3                            BANKMASK(MDSRC), 3, b
#define SRCS4                            BANKMASK(MDSRC), 4, b
#define SRENA                            BANKMASK(RC1STA), 5, a
#define SS2                              BANKMASK(PORTD), 7, a
#define SSP1CLKPPS0                      BANKMASK(SSP1CLKPPS), 0, b
#define SSP1CLKPPS1                      BANKMASK(SSP1CLKPPS), 1, b
#define SSP1CLKPPS2                      BANKMASK(SSP1CLKPPS), 2, b
#define SSP1CLKPPS3                      BANKMASK(SSP1CLKPPS), 3, b
#define SSP1CLKPPS4                      BANKMASK(SSP1CLKPPS), 4, b
#define SSP1DATPPS0                      BANKMASK(SSP1DATPPS), 0, b
#define SSP1DATPPS1                      BANKMASK(SSP1DATPPS), 1, b
#define SSP1DATPPS2                      BANKMASK(SSP1DATPPS), 2, b
#define SSP1DATPPS3                      BANKMASK(SSP1DATPPS), 3, b
#define SSP1DATPPS4                      BANKMASK(SSP1DATPPS), 4, b
#define SSP1IE                           BANKMASK(PIE3), 0, b
#define SSP1IF                           BANKMASK(PIR3), 0, b
#define SSP1IP                           BANKMASK(IPR3), 0, b
#define SSP1SSPPS0                       BANKMASK(SSP1SSPPS), 0, b
#define SSP1SSPPS1                       BANKMASK(SSP1SSPPS), 1, b
#define SSP1SSPPS2                       BANKMASK(SSP1SSPPS), 2, b
#define SSP1SSPPS3                       BANKMASK(SSP1SSPPS), 3, b
#define SSP1SSPPS4                       BANKMASK(SSP1SSPPS), 4, b
#define SSP1SSPPS5                       BANKMASK(SSP1SSPPS), 5, b
#define SSP2CLKPPS0                      BANKMASK(SSP2CLKPPS), 0, b
#define SSP2CLKPPS1                      BANKMASK(SSP2CLKPPS), 1, b
#define SSP2CLKPPS2                      BANKMASK(SSP2CLKPPS), 2, b
#define SSP2CLKPPS3                      BANKMASK(SSP2CLKPPS), 3, b
#define SSP2CLKPPS4                      BANKMASK(SSP2CLKPPS), 4, b
#define SSP2DATPPS0                      BANKMASK(SSP2DATPPS), 0, b
#define SSP2DATPPS1                      BANKMASK(SSP2DATPPS), 1, b
#define SSP2DATPPS2                      BANKMASK(SSP2DATPPS), 2, b
#define SSP2DATPPS3                      BANKMASK(SSP2DATPPS), 3, b
#define SSP2DATPPS4                      BANKMASK(SSP2DATPPS), 4, b
#define SSP2IE                           BANKMASK(PIE3), 2, b
#define SSP2IF                           BANKMASK(PIR3), 2, b
#define SSP2IP                           BANKMASK(IPR3), 2, b
#define SSP2SSPPS0                       BANKMASK(SSP2SSPPS), 0, b
#define SSP2SSPPS1                       BANKMASK(SSP2SSPPS), 1, b
#define SSP2SSPPS2                       BANKMASK(SSP2SSPPS), 2, b
#define SSP2SSPPS3                       BANKMASK(SSP2SSPPS), 3, b
#define SSP2SSPPS4                       BANKMASK(SSP2SSPPS), 4, b
#define SSPEN1                           BANKMASK(SSP1CON1), 5, a
#define SSPEN2                           BANKMASK(SSP2CON1), 5, b
#define SSPM01                           BANKMASK(SSP1CON1), 0, a
#define SSPM02                           BANKMASK(SSP2CON1), 0, b
#define SSPM11                           BANKMASK(SSP1CON1), 1, a
#define SSPM12                           BANKMASK(SSP2CON1), 1, b
#define SSPM21                           BANKMASK(SSP1CON1), 2, a
#define SSPM22                           BANKMASK(SSP2CON1), 2, b
#define SSPM31                           BANKMASK(SSP1CON1), 3, a
#define SSPM32                           BANKMASK(SSP2CON1), 3, b
#define SSPOV1                           BANKMASK(SSP1CON1), 6, a
#define SSPOV2                           BANKMASK(SSP2CON1), 6, b
#define START1                           BANKMASK(SSP1STAT), 3, a
#define START2                           BANKMASK(SSP2STAT), 3, b
#define STATE                            BANKMASK(WDTTMR), 2, b
#define STKOVF                           BANKMASK(PCON0), 7, a
#define STKPTR0                          BANKMASK(STKPTR), 0, a
#define STKPTR1                          BANKMASK(STKPTR), 1, a
#define STKPTR2                          BANKMASK(STKPTR), 2, a
#define STKPTR3                          BANKMASK(STKPTR), 3, a
#define STKPTR4                          BANKMASK(STKPTR), 4, a
#define STKPTR5                          BANKMASK(STKPTR), 5, a
#define STKUNF                           BANKMASK(PCON0), 6, a
#define STOP1                            BANKMASK(SSP1STAT), 4, a
#define STOP2                            BANKMASK(SSP2STAT), 4, b
#define STRA                             BANKMASK(CWG1STR), 0, b
#define STRB                             BANKMASK(CWG1STR), 1, b
#define STRC                             BANKMASK(CWG1STR), 2, b
#define STRD                             BANKMASK(CWG1STR), 3, b
#define SWDTEN                           BANKMASK(WDTCON0), 0, b
#define SYNC1                            BANKMASK(TX1STA), 4, a
#define SYSCMD                           BANKMASK(PMD0), 7, b
#define T016BIT                          BANKMASK(T0CON0), 4, a
#define T0ASYNC                          BANKMASK(T0CON1), 4, a
#define T0CKIPPS0                        BANKMASK(T0CKIPPS), 0, b
#define T0CKIPPS1                        BANKMASK(T0CKIPPS), 1, b
#define T0CKIPPS2                        BANKMASK(T0CKIPPS), 2, b
#define T0CKIPPS3                        BANKMASK(T0CKIPPS), 3, b
#define T0CKPS0                          BANKMASK(T0CON1), 0, a
#define T0CKPS1                          BANKMASK(T0CON1), 1, a
#define T0CKPS2                          BANKMASK(T0CON1), 2, a
#define T0CKPS3                          BANKMASK(T0CON1), 3, a
#define T0CS0                            BANKMASK(T0CON1), 5, a
#define T0CS1                            BANKMASK(T0CON1), 6, a
#define T0CS2                            BANKMASK(T0CON1), 7, a
#define T0EN                             BANKMASK(T0CON0), 7, a
#define T0OUT                            BANKMASK(T0CON0), 5, a
#define T0OUTPS0                         BANKMASK(T0CON0), 0, a
#define T0OUTPS1                         BANKMASK(T0CON0), 1, a
#define T0OUTPS2                         BANKMASK(T0CON0), 2, a
#define T0OUTPS3                         BANKMASK(T0CON0), 3, a
#define T0PR0                            BANKMASK(TMR0H), 0, a
#define T0PR1                            BANKMASK(TMR0H), 1, a
#define T0PR2                            BANKMASK(TMR0H), 2, a
#define T0PR3                            BANKMASK(TMR0H), 3, a
#define T0PR4                            BANKMASK(TMR0H), 4, a
#define T0PR5                            BANKMASK(TMR0H), 5, a
#define T0PR6                            BANKMASK(TMR0H), 6, a
#define T0PR7                            BANKMASK(TMR0H), 7, a
#define T0PS0                            BANKMASK(T0CON1), 0, a
#define T0PS1                            BANKMASK(T0CON1), 1, a
#define T0PS2                            BANKMASK(T0CON1), 2, a
#define T0PS3                            BANKMASK(T0CON1), 3, a
#define T1CKIPPS0                        BANKMASK(T1CKIPPS), 0, b
#define T1CKIPPS1                        BANKMASK(T1CKIPPS), 1, b
#define T1CKIPPS2                        BANKMASK(T1CKIPPS), 2, b
#define T1CKIPPS3                        BANKMASK(T1CKIPPS), 3, b
#define T1CKIPPS4                        BANKMASK(T1CKIPPS), 4, b
#define T1CKPS0                          BANKMASK(T1CON), 4, a
#define T1CKPS1                          BANKMASK(T1CON), 5, a
#define T1CS0                            BANKMASK(T1CLK), 0, a
#define T1CS1                            BANKMASK(T1CLK), 1, a
#define T1CS2                            BANKMASK(T1CLK), 2, a
#define T1CS3                            BANKMASK(T1CLK), 3, a
#define T1GE                             BANKMASK(T1GCON), 7, a
#define T1GGO                            BANKMASK(T1GCON), 3, a
#define T1GGO_NOT_DONE                   BANKMASK(T1GCON), 3, a
#define T1GGO_nDONE                      BANKMASK(T1GCON), 3, a
#define T1GPOL                           BANKMASK(T1GCON), 6, a
#define T1GPPS0                          BANKMASK(T1GPPS), 0, b
#define T1GPPS1                          BANKMASK(T1GPPS), 1, b
#define T1GPPS2                          BANKMASK(T1GPPS), 2, b
#define T1GPPS3                          BANKMASK(T1GPPS), 3, b
#define T1GPPS4                          BANKMASK(T1GPPS), 4, b
#define T1GSPM                           BANKMASK(T1GCON), 4, a
#define T1GSS0                           BANKMASK(T1GATE), 0, a
#define T1GSS1                           BANKMASK(T1GATE), 1, a
#define T1GSS2                           BANKMASK(T1GATE), 2, a
#define T1GSS3                           BANKMASK(T1GATE), 3, a
#define T1GTM                            BANKMASK(T1GCON), 5, a
#define T1GVAL                           BANKMASK(T1GCON), 2, a
#define T1RD16                           BANKMASK(T1CON), 1, a
#define T2CKPOL                          BANKMASK(T2HLT), 6, a
#define T2CKPS0                          BANKMASK(T2CON), 4, a
#define T2CKPS1                          BANKMASK(T2CON), 5, a
#define T2CKPS2                          BANKMASK(T2CON), 6, a
#define T2CKSYNC                         BANKMASK(T2HLT), 5, a
#define T2CS0                            BANKMASK(T2CLKCON), 0, a
#define T2CS1                            BANKMASK(T2CLKCON), 1, a
#define T2CS2                            BANKMASK(T2CLKCON), 2, a
#define T2CS3                            BANKMASK(T2CLKCON), 3, a
#define T2INPPS0                         BANKMASK(T2INPPS), 0, b
#define T2INPPS1                         BANKMASK(T2INPPS), 1, b
#define T2INPPS2                         BANKMASK(T2INPPS), 2, b
#define T2INPPS3                         BANKMASK(T2INPPS), 3, b
#define T2INPPS4                         BANKMASK(T2INPPS), 4, b
#define T2MODE0                          BANKMASK(T2HLT), 0, a
#define T2MODE1                          BANKMASK(T2HLT), 1, a
#define T2MODE2                          BANKMASK(T2HLT), 2, a
#define T2MODE3                          BANKMASK(T2HLT), 3, a
